//////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗарегистрироватьСообщение(ПочтовоеСообщение) Экспорт
	Запись 						= РегистрыСведений.ПочтовыеСообщенияВходящие.СоздатьМенеджерЗаписи();
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Записать();
КонецПроцедуры // ЗарегистрироватьСообщение

Процедура УстановитьОтметкуОбработки(ПочтовоеСообщение, СообщениеОбОшибке = Неопределено) Экспорт
	Запись 						= РегистрыСведений.ПочтовыеСообщенияВходящие.СоздатьМенеджерЗаписи();
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если СообщениеОбОшибке = Неопределено Тогда
			Запись.Обработано 			= Истина;
			Запись.СообщениеОбОшибке 	= "";
		Иначе
			Запись.Обработано 			= Ложь;
			Запись.СообщениеОбОшибке 	= СообщениеОбОшибке;
			Запись.КоличествоПопыток	= Запись.КоличествоПопыток + 1;
		КонецЕсли; // Если СообщениеОбОшибке = Неопределено Тогда
		Запись.Записать();
	КонецЕсли; // Если Запись.Выбран() Тогда   	
КонецПроцедуры // УстановитьОтметкуОбработки

