
&НаСервере
Процедура ОчиститьВсеНаСервере()
	
	Набор = РегистрыСведений.ВходящиеЭлектронныеПисьма.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиситьВсеПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьВсеНаСервере();
		Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиситьВсеПродолжение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Уверены?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры
