
&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьПродолжение", ЭтаФорма), "Список эталонов будет перезаполнен полностью. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Состояние("Перезаполнение регистра эталонов...", , , БиблиотекаКартинок.ДлительнаяОперация48);
		
		ВызватьПерезаполнениеРегистраЭталонов();
		
		Элементы.Список.Обновить();
		
		ПоказатьПредупреждение(, "Перезаполнение завершено");
		
	Иначе
		
		ПоказатьПредупреждение(, "Прервано пользователем!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВызватьПерезаполнениеРегистраЭталонов()
	
	ОбновлениеИнформационнойБазыИСС_ЗИП.ЗаполнитьЭталонныеИзделияВСтруктуреЗаказов();
	
КонецПроцедуры
