/////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработчикУдаленияДубликатов(УдалениеПроизведено, ДопПараметры) Экспорт
	Если Не УдалениеПроизведено Тогда                                      	
		Возврат;
	КонецЕсли; // Если Не УдалениеПроизведено Тогда	
	Элементы.Список.Обновить();		               
КонецПроцедуры // ОбработчикУдаленияДубликатов

/////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура УдалитьДубликаты(Команда)	
	Если Элементы.Список.ВыделенныеСтроки.Количество() < 2 Тогда  		
		ПоказатьПредупреждение(, "Выбрано менее двух элементов!");
		Возврат;                                                  		
	КонецЕсли; // Если Элементы.Список.ВыделенныеСтроки.Количество() < 2 Тогда  		
	
	ПараметрыОткрытия 	= Новый Структура;
	ПараметрыОткрытия.Вставить("Дубликаты", 			Элементы.Список.ВыделенныеСтроки);
	ПараметрыОткрытия.Вставить("ОригинальныйЭлемент", 	Элементы.Список.ТекущиеДанные.Ссылка);	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикУдаленияДубликатов", ЭтотОбъект);   	
	ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма", ПараметрыОткрытия, 
														ЭтотОбъект,,,, 
														ОписаниеОповещения, 
														РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры // УдалитьДубликаты

/////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

