/////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СформироватьТаблицуДвиженийРаспределениеЗаявок(Ссылка) Экспорт 
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка.Дата КАК Период,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка.Заявка КАК Заявка,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка.Исполнитель КАК Исполнитель,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Количество КАК Количество
	             	  |ИЗ
	             	  |	Документ.РаспределениеЗаявки.ПредметыСнабжения КАК РаспределениеЗаявкиПредметыСнабжения
	             	  |ГДЕ
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // СформироватьТаблицуДвиженийРаспределениеЗаявок
