#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат ПрисоединенныеФайлы.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

#КонецОбласти

#КонецЕсли

//////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьВложения(ПочтовоеСообщение) Экспорт
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ПочтовоеСообщениеПрисоединенныеФайлы.Ссылка КАК Ссылка
	             	  |ИЗ
	             	  |	Справочник.ПочтовоеСообщениеПрисоединенныеФайлы КАК ПочтовоеСообщениеПрисоединенныеФайлы
	             	  |ГДЕ
	             	  |	ПочтовоеСообщениеПрисоединенныеФайлы.ВладелецФайла = &ПочтовоеСообщение";
	Запрос.УстановитьПараметр("ПочтовоеСообщение", ПочтовоеСообщение);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции // ПолучитьВложения

