///////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ДобвавитьЗапись(СтруктураЗаписи) Экспорт 
	Результат 		= Истина;
	
	Если Не СтруктураЗаписи.Свойство("ПредметСнабжения") 
		Или Не СтруктураЗаписи.Свойство("СоставляющаяЧасть") Тогда
		Результат 	= Ложь;
		Возврат Результат;
	КонецЕсли; // Если Не СтруктураЗаписи.Свойство("ПредметСнабжения") 
	
	Запись 			= РегистрыСведений.СпецификацииПС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаписи);
	
	Если Запись.Количество = 0 Тогда
		Запись.Количество = 1;
	КонецЕсли; // Если Запись.Количество = 0 Тогда
	
	Попытка
		Запись.Записать();
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции // ДобвавитьЗапись
