
/////////////////////////////////////////////////
// 	ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
	
		РезультатПроверки = СпецификацииПредметовСнабжения.ПроверитьВозможностьДобавленияСоставнойЧастиВСпецификациюПредметаСнабжения(ТекущаяЗапись.ПредметСнабжения, ТекущаяЗапись.СоставляющаяЧасть);
		Если РезультатПроверки.Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.Описание,,,,Отказ);
			Прервать;
		КонецЕсли;
	
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
