/////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьКартуМаршрута()	
	СтруктураОбъект 	= РеквизитФормыВЗначение("Объект");
    КартаБизнесПроцесса = СтруктураОбъект.ПолучитьКартуМаршрута();
	Если СтруктураОбъект.Завершен Тогда
		Состояние 							= "Завершено";
		Элементы.СостояниеКартинка.Картинка = БиблиотекаКартинок.ЗеленыйФлаг;
	ИначеЕсли СтруктураОбъект.РаспределениеСогласовано Тогда
		Состояние 							= "Согласовано";
		Элементы.СостояниеКартинка.Картинка = БиблиотекаКартинок.ОранжевыйФлаг;
	Иначе
		Состояние 							= "В процессе";
		Элементы.СостояниеКартинка.Картинка = БиблиотекаКартинок.ЖелтыйФлаг;
	КонецЕсли; // Если СтруктураОбъект.Завершен Тогда
КонецПроцедуры // ОбновитьКартуМаршрута

/////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаОбновитьКартуМаршрута(Команда)
	ОбновитьКартуМаршрута();
КонецПроцедуры // КомандаОбновитьКартуМаршрута

&НаКлиенте
Процедура КомандаПоказатьВложения(Команда)
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", 	Объект.Заявка);	
	ПараметрыФормы.Вставить("ТолькоПросмотр", 	Истина);	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры // КомандаПоказатьВложения

/////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьКартуМаршрута();
	Элементы.КомандаПоказатьВложения.Заголовок 	= Справочники.ЗаявкаФСВТСПрисоединенныеФайлы.ПолучитьКоличество(Объект.Заявка);
	ИсторияСогласования 						= Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументИсторииСогласования(Объект.Ссылка);
КонецПроцедуры // ПриЧтенииНаСервере