#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат ПрисоединенныеФайлы.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

#КонецОбласти

#КонецЕсли

Функция ПолучитьКоличество(Заявка) Экспорт
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ЗаявкаФСВТСПрисоединенныеФайлы.Ссылка КАК Ссылка
	             	  |ИЗ
	             	  |	Справочник.ЗаявкаФСВТСПрисоединенныеФайлы КАК ЗаявкаФСВТСПрисоединенныеФайлы
	             	  |ГДЕ
	             	  |	ЗаявкаФСВТСПрисоединенныеФайлы.ВладелецФайла = &Заявка
	             	  |	И НЕ ЗаявкаФСВТСПрисоединенныеФайлы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат Запрос.Выполнить().Выгрузить().Количество();
КонецФункции // ПолучитьКоличество
