///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьРуководителя(Заказчик) Экспорт
	Результат 		= Неопределено;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	РегиональныеРуководителиФСВТС.Руководитель КАК Руководитель
	             	  |ИЗ
	             	  |	РегистрСведений.РегиональныеРуководителиФСВТС КАК РегиональныеРуководителиФСВТС
	             	  |ГДЕ
	             	  |	РегиональныеРуководителиФСВТС.Заказчик = &Заказчик";
	Запрос.УстановитьПараметр("Заказчик", Заказчик);
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Руководитель;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	
	Возврат Результат;
КонецФункции // ПолучитьРуководителя
