&НаСервереБезКонтекста
Функция ДатаКорректна(Дата, Экземпляр)
	
	ДатаВвода = Экземпляр.ДатаВвода;
	
	Возврат Не ЗначениеЗаполнено(ДатаВвода) Или Дата > ДатаВвода;
	
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Запись.Период > ТекущаяДата() Тогда
		
		Сообщить("Введенная дата больше текущей!");
		Запись.Период = Дата("00010101");
		
	ИначеЕсли Не ДатаКорректна(Запись.Период, Запись.Экземпляр) Тогда
		
		Сообщить("Введенная дата меньше даты ввода в эксплуатацию!");
		Запись.Период = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработчикВводаНаработки", ЭтаФорма), "Произошло восстановление ресурсов?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаНаработки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
				
		ИмяФормыВвода = "РегистрСведений.ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.Форма.ФормаВводаНаработки";
		ПараметрыОткрытия = Новый Структура("Дата, Экземпляр", Запись.Период, Запись.Экземпляр);
		ОбработчикЗавершения = Новый ОписаниеОповещения("ОбработчикЗавершения", ЭтаФорма);
		
		ОткрытьФорму(ИмяФормыВвода, ПараметрыОткрытия, ЭтаФорма, , , , ОбработчикЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ЗакрытьФорму Тогда
		
		Закрыть();
		
	Иначе
		
		ЗакрытьФорму = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗакрытьФорму Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьИЗакрыть.ИмяКоманды = "ЗаписатьИЗакрыть";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтаФорма.Записать();
	ЗакрытьФорму = Истина;
	
КонецПроцедуры
