
Процедура ПередЗаписью(Отказ)
	
	//+ 27.03.2017 15:53:25 Базунов Дмитрий Задача: 
	
	// закоментил, т.к. в модуле формы есть ПриЗаписиНаСервере()
	// СлужебныеФункции.НайтиДубльСправочникаПоНаименованию(ТекущийОбъект.Ссылка, ТекущийОбъект.Наименование)
	
	//- 27.03.2017 15:53:25 Базунов Дмитрий Задача: 
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Языки.Ссылка
	//|ИЗ
	//|	Справочник.Языки КАК Языки
	//|ГДЕ
	//|	Языки.Наименование = &Наименование
	//|	И НЕ Языки.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Наименование", Наименование);
	//
	//// Кроме текущего
	////+ 27.03.2017 15:50:18 Базунов Дмитрий Задача: 
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	////- 27.03.2017 15:50:18 Базунов Дмитрий Задача: 	
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//
	//	Отказ = Истина;
	//	Сообщить("В системе уже есть язык с таким наименованием.");
	//	Возврат;	
	//
	//КонецЕсли;
	
КонецПроцедуры
