
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//++ 14.05.2018 Веденеев П. //проверка буквенного кода
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Объект.Наименование) Тогда
		
		Сообщить("Недопустимые символы в буквенном коде (допустима только латиница)!");
		Отказ = Истина;
		Возврат;
		                                                 
	КонецЕсли;
	//-- 14.05.2018 Веденеев П. //проверка буквенного кода
	
	//++ 13.03.2018 Веденеев П. //отключение непосредственного изменения данных
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыДляКорректировкиСправочников") И 
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаАкцептоватьИзмененияВСправочнике.Видимость Тогда
	
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	Выборка = Справочники.ОКВ.Выбрать(,,Новый Структура("Наименование",ТекущийОбъект.Наименование));
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.Ссылка = ТекущийОбъект.Ссылка Тогда
		
			Сообщить("В справочнике уже есть элемент с таким буквенным кодом!",СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Выборка = Справочники.ОКВ.Выбрать(,,Новый Структура("НаименованиеПолное",ТекущийОбъект.НаименованиеПолное));
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.Ссылка = ТекущийОбъект.Ссылка Тогда
		
			Сообщить("В справочнике уже есть элемент с таким наименованием!",СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;

		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ 13.03.2018 Веденеев П. //отключение непосредственного изменения данных
	КорректировкаДанныхСправочников.ОтключитьНепосредственноеИзменениеДанных(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//++ 13.03.2018 Веденеев П. //отключение непосредственного изменения данных
	КорректировкаДанныхСправочников.ОтключитьНепосредственноеИзменениеДанных(ЭтаФорма);
	
КонецПроцедуры
