
///////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбработатьСтруктуруЗаказов(ПредметСнабжения) Экспорт
	
	СтруктураЗаказа.ОбработатьСтруктуруЗаказов(ПредметСнабжения);
	
КонецПроцедуры // ОбработатьСтруктуруЗаказов

Функция ПеренестиЭлементыСтруктуры(МассивСсылокИсточников, СсылкаПриемник) Экспорт
	
	Возврат СтруктураЗаказа.ПеренестиЭлементыСтруктуры(МассивСсылокИсточников, СсылкаПриемник);
	
КонецФункции // ПеренестиЭлементыСтруктуры
