
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Вложение = Запись.ИмяФайла;
	
	Элементы.Вложение.Видимость = (НЕ Вложение = "");
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВложениеВовременноеХранилище()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Запись");
	ФайлВложение = РеквизитОбъект.Вложение.Получить();
	Если ФайлВложение = Неопределено Тогда
		Возврат "";
	Иначе 
		Возврат ПоместитьВоВременноеХранилище(ФайлВложение);
	КонецЕсли; 

КонецФункции
 
&НаКлиенте
Процедура ВложениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Адрес = ПоместитьВложениеВовременноеХранилище();

	Если Адрес = "" Тогда
		Возврат;
	КонецЕсли; 
	
	ФайлВложение = ПолучитьИзВременногоХранилища(Адрес);
	ИмяФайла = КаталогВременныхФайлов() + Запись.ИмяФайла;
	ФайлВложение.Записать(ИмяФайла);
	Вложение = Запись.ИмяФайла;
	
	ЗапуститьПриложение(ИмяФайла);
	
КонецПроцедуры
 