Процедура СохранитьСтатистикуНаполненияБД() Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	НастройкиКомпоновщика.Структура.Очистить();
	НоваяГруппировка = НастройкиКомпоновщика.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
    ПолеГруппировки.Использование = Истина;
    ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Корабль");
	
	ВыбранноеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));   
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Корабль");
	
	АвтоПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	
	ТЗ = Новый ТаблицаЗначений; 
	
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Выборка = РегистрыСведений.
	
	Для каждого Стр Из ТЗ Цикл
		МЗ = РегистрыСведений.СтатистикаНаполненияБД.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Стр);
		МЗ.Период = ТекущаяДата();
		МЗ.Записать(Истина);
	КонецЦикла; 
	
КонецПроцедуры
