
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
			
	КонецЕсли; 
	
	Если Параметры.Свойство("ТекущийЭтап") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Код");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = Параметры.ТекущийЭтап.Код;
		
	КонецЕсли; 	
	
КонецПроцедуры
