/////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция НайтиПоОбозначению(Обозначение) Экспорт 
	Результат 		= Неопределено;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	НеиденитифицированныеПредметыСнабжения.Ссылка КАК Ссылка
	             	  |ИЗ
	             	  |	Справочник.НеиденитифицированныеПредметыСнабжения КАК НеиденитифицированныеПредметыСнабжения
	             	  |ГДЕ
	             	  |	НЕ НеиденитифицированныеПредметыСнабжения.ПометкаУдаления
	             	  |	И НеиденитифицированныеПредметыСнабжения.ОбозначениеДляПоиска = &ОбозначениеДляПоиска";
	Запрос.УстановитьПараметр("ОбозначениеДляПоиска", ВРег(СокрЛП(Обозначение)));
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Ссылка;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	Возврат Результат;
КонецФункции // НайтиПоОбозначению

Функция Создать(Наименование, Обозначение) Экспорт
	Элемент 				= Справочники.НеиденитифицированныеПредметыСнабжения.СоздатьЭлемент();
	Элемент.Наименование 	= Наименование;
	Элемент.Обозначение 	= Обозначение;
	Элемент.Записать();
	Возврат Элемент.Ссылка;
КонецФункции // Создать
