
////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция НайтиУсловиеПоставки(Структура) Экспорт 
	Результат 		= Неопределено;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	УсловияПоставок.Ссылка КАК Ссылка
	             	  |ИЗ
	             	  |	Справочник.УсловияПоставок КАК УсловияПоставок
	             	  |ГДЕ
	             	  |	НЕ УсловияПоставок.ПометкаУдаления
	             	  |	И УсловияПоставок.Количество = &Количество";
	Запрос.УстановитьПараметр("Количество", Структура.Количество);
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Ссылка;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	
	Возврат Результат;
КонецФункции // НайтиУсловиеПоставки

Функция СоздатьУсловиеПоставки(Структура) Экспорт 
	Результат 		= НайтиУсловиеПоставки(Структура);
	Если Не Результат = Неопределено Тогда
		Возврат Результат;
	КонецЕсли; // Если Не Результат = Неопределено Тогда
	
	УсловиеПоставки 	= Справочники.УсловияПоставок.СоздатьЭлемент();
	УсловиеПоставки.УстановитьНовыйКод();
	Структура.Свойство("Количество", 		УсловиеПоставки.Количество);
	УсловиеПоставки.Наименование = СтрШаблон(НСтр("ru = 'Количество = %1'"), УсловиеПоставки.Количество);
	УсловиеПоставки.Записать();
	Результат = УсловиеПоставки.Ссылка;
	Возврат Результат;
КонецФункции // СоздатьУсловиеПоставки
