
&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
	
		ПоказатьПредупреждение(, "Перед проверкой подключения объект необходимо записать.",, "Действие запрещено");
		Возврат;
	
	КонецЕсли;
	
	ПоказатьПредупреждение(, ПроверитьСоединениеНаСервере(),, "Результат проверки");
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСоединениеНаСервере()

	Если Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.MSSQLConnection Тогда
	
		Соединение = РаботаСMSSQL.УстановитьСоединение(Объект.Ссылка);
	
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
	
		Возврат "Не удалось установить соединение. Подродности в информации об ошибках.";
		
	Иначе
		
		Соединение.Close();
		Возврат "Соединение успешно установлено.";
	
	КонецЕсли;

КонецФункции // ПроверитьСоединениеНаСервере()

&НаСервере
Процедура ИзменитьВидимостьЭлементов()
	
	Если Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.MSSQLConnection Тогда
		Элементы.ЭлектроннаяПочта.Видимость = Ложь;
		Элементы.MSSQL.Видимость = Истина;
		Элементы.WebСервис.Видимость = Ложь;
	ИначеЕсли Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.WebСервис Тогда
		Элементы.ЭлектроннаяПочта.Видимость = Ложь;
		Элементы.MSSQL.Видимость = Ложь;
		Элементы.WebСервис.Видимость = Истина;
	ИначеЕсли Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.ЭлектроннаяПочта Тогда
		Элементы.ЭлектроннаяПочта.Видимость = Истина;
		Элементы.MSSQL.Видимость = Ложь;
		Элементы.WebСервис.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗначения()
	
	Объект.Наименование = "";
	Объект.ИмяСервера = "";
	Объект.ИмяБазы = "";
	Объект.Пользователь = "";
	Объект.Пароль = "";
	Объект.СсылкаНаWebСервис = "";
	Объект.КодАбонента = "";
	
КонецПроцедуры
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьВидимостьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ТипСоединенияПриИзменении(Элемент)
	
	ОчиститьЗначения();
	
	ИзменитьВидимостьЭлементов();
	
КонецПроцедуры

