&НаКлиенте
Функция ПодключитсяКЭксель()
	
	XLSОбъект = Новый COMОбъект("Excel.Application"); 
	
    Попытка
        Эксель = XLSОбъект.Workbooks.Open(ПутьКФайлу, , Истина);
    Исключение
		Инф = ИнформацияОбОшибке();
		Сообщить ("Проблемы с подключением к Excel: " + Инф.Причина.Описание);
		Возврат Неопределено;
    КонецПопытки;
	
	Возврат Эксель; 
	
КонецФункции

&НаСервере
Процедура ЗагрузитьКаталогНаСервере()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКаталог(Команда)
	
	Эксель = ПодключитсяКЭксель();
	
	ЛистЭксель = Эксель.WorkSheets(1); 
	
	ВсегоСтрок = ЛистЭксель.Cells.SpecialCells(11).Row; 
	ВсегоКолонок = ЛистЭксель.Cells.SpecialCells(11).Column;
	
	ВсегоСтрок = ЛистЭксель.Cells.SpecialCells(11).Row; 
	ВсегоКолонок = ЛистЭксель.Cells.SpecialCells(11).Column;
	
	Порция = Окр(ВсегоСтрок / 100); Прогресс=0;
	
	Для сч = 3 По ВсегоСтрок Цикл // Самую первую пропускаем
		
		Стр1 = СокрЛП(ЛистЭксель.Cells(сч, 1).value); // НСН
		Стр2 = СокрЛП(ЛистЭксель.Cells(сч, 2).value); // Обозначение
		Стр3 = СокрЛП(ЛистЭксель.Cells(сч, 7).value); // INC
		Стр4 = СокрЛП(ЛистЭксель.Cells(сч, 9).value); // Наименование рус
		Стр5 = СокрЛП(ЛистЭксель.Cells(сч, 12).value); // NCAGE
		Стр6 = СокрЛП(ЛистЭксель.Cells(сч, 14).value); // Наименование организации
		Стр7 = СокрЛП(ЛистЭксель.Cells(сч, 7).value);
		Стр8 = ""; //СокрЛП(ЛистЭксель.Cells(сч, 9).value);
		Стр9 = ""; //СокрЛП(ЛистЭксель.Cells(сч, 11).value);
		
		НовСтр = Таблица.Добавить();
		
		Если сч % Порция = 0 Тогда
			Состояние("Грузим", Прогресс);
			Прогресс = Прогресс + 1
		КонецЕсли;
		
	КонецЦикла;
	
	Эксель = Неопределено;
	
	ЗагрузитьКаталогНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКФайлу = "D:\Материалы заказчиков\Каталог НАТО\Сводный каталог 28.08.2017.xlsx";
	
КонецПроцедуры
