
&НаСервере
Процедура ЗагрузитьКаталогНаСервере()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКаталог(Команда)
	
	ПараметрыФайла = РаботаСФайламиOfficeКлиент.ПодготовитьФайлКЧтению(ПутьКФайлу, "ТабличныйДокумент");
	Если ПараметрыФайла = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ПараметрыФайла = Неопределено Тогда
	
	ТабличныйДокумент = РаботаСФайламиOffice.ПрочитатьФайлВТабличныйДокумент(ПараметрыФайла.Адрес, ПараметрыФайла);
	Если ТабличныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ТабличныйДокумент = Неопределено Тогда
	
	ЛистЭксель = ТабличныйДокумент; 
	
	ВсегоСтрок = ЛистЭксель.ВысотаТаблицы; 
	ВсегоКолонок = ЛистЭксель.ШиринаТаблицы;
	
	Порция = Окр(ВсегоСтрок / 100); Прогресс=0;
	
	Для сч = 3 По ВсегоСтрок Цикл // Самую первую пропускаем
		
		Стр1 = СокрЛП(ЛистЭксель.Область(сч, 1).Текст); // НСН
		Стр2 = СокрЛП(ЛистЭксель.Область(сч, 2).Текст); // Обозначение
		Стр3 = СокрЛП(ЛистЭксель.Область(сч, 7).Текст); // INC
		Стр4 = СокрЛП(ЛистЭксель.Область(сч, 9).Текст); // Наименование рус
		Стр5 = СокрЛП(ЛистЭксель.Область(сч, 12).Текст); // NCAGE
		Стр6 = СокрЛП(ЛистЭксель.Область(сч, 14).Текст); // Наименование организации
		Стр7 = СокрЛП(ЛистЭксель.Область(сч, 7).Текст);
		Стр8 = ""; //СокрЛП(ЛистЭксель.Область(сч, 9).Текст);
		Стр9 = ""; //СокрЛП(ЛистЭксель.Область(сч, 11).Текст);
		
		НовСтр = Таблица.Добавить();
		
		Если сч % Порция = 0 Тогда
			Состояние("Грузим", Прогресс);
			Прогресс = Прогресс + 1
		КонецЕсли;
		
	КонецЦикла;
	
	ЗагрузитьКаталогНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКФайлу = "D:\Материалы заказчиков\Каталог НАТО\Сводный каталог 28.08.2017.xlsx";
	
КонецПроцедуры
