&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыУчетаНаработки();
	
КонецПроцедуры

//процедура заполняет списки параметров учета наработки исходя из указанных для предмета снабжения
&НаСервере
Процедура ЗаполнитьПараметрыУчетаНаработки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПараметрУчета КАК ПараметрУчета,
	|	МАКСИМУМ(РесурсыИСрокиСлужбыПредметовСнабжения.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.РесурсыИСрокиСлужбыПредметовСнабжения КАК РесурсыИСрокиСлужбыПредметовСнабжения
	|ГДЕ
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПредметСнабжения = &ПредметСнабжения
	|
	|СГРУППИРОВАТЬ ПО
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПараметрУчета";
	Запрос.УстановитьПараметр("ПредметСнабжения", Запись.Экземпляр.Владелец.ПредметСнабжения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		
	Элементы.ПараметрУчета.СписокВыбора.ЗагрузитьЗначения(ТаблицаЗапроса.ВыгрузитьКолонку("ПараметрУчета"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаКорректна(Дата, Экземпляр)
	
	ДатаВвода = Экземпляр.ДатаВвода;
	
	Возврат Не ЗначениеЗаполнено(ДатаВвода) Или Дата > ДатаВвода;
	
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Запись.Период > ТекущаяДата() Тогда
		
		Сообщить("Введенная дата больше текущей!");
		Запись.Период = Дата("00010101");
		
	ИначеЕсли Не ДатаКорректна(Запись.Период, Запись.Экземпляр) Тогда
		
		Сообщить("Введенная дата меньше даты ввода в эксплуатацию!");
		Запись.Период = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрУчетаПриИзменении(Элемент)

	Запись.ЕдиницаИзмерения = ПолучитьЗначениеРеквизита(Запись.ПараметрУчета, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции
