Процедура ЗаполнитьИзКлассификатора() Экспорт
	
	СпрТН = Справочники.ТНВЭД;
	
	// Перенесем что есть в папку удаленные
	Найд = СпрТН.НайтиПоКоду("0000000000001");
	Если Найд = СпрТН.ПустаяСсылка() Тогда
		НовГр = СпрТН.СоздатьГруппу();
		НовГр.Наименование = "Удаленные";
		НовГр.ПолноеНаименование = "Удаленные";
		НовГр.Код = "0000000000001";
		НовГр.Записать();
		СсылкаГруппа = НовГр.Ссылка;
		Выборка = СпрТН.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления ИЛИ Выборка.Ссылка = СсылкаГруппа ИЛИ Выборка.Родитель = СсылкаГруппа Тогда
				Продолжить;
			КонецЕсли; 
			СпрОб = Выборка.ПолучитьОбъект();
			СпрОб.УстановитьНовыйКод("00000");
			СпрОб.ПолноеНаименование = "Было: " + СпрОб.Код;
			Если Выборка.Родитель.Пустая() Тогда
				СпрОб.Родитель = СсылкаГруппа;
			КонецЕсли;
			СпрОб.УстановитьПометкуУдаления(Истина);
			СпрОб.Записать();
		КонецЦикла; 
	КонецЕсли;	
	
	// ++ Разделы ТН ВЭД
	
	СпрПустая = СпрТН.ПустаяСсылка();
	
	ТаблДок = СпрТН.ПолучитьМакет("тн1");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	Для сч = 1 По Всего Цикл
		
		КодРаздела 	 = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		Наименование = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст);
		
		КодСпр = "РАЗДЕЛ " + СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(Число(КодРаздела), Ложь);
		
		Найд = СпрТН.НайтиПоКоду(КодСпр);
		Если Найд = СпрПустая Тогда
			СпрОб = СпрТН.СоздатьГруппу();
		Иначе
			СпрОб = Найд.ПолучитьОбъект();
		КонецЕсли;
		
		НадоИзменить = Ложь;
		Если СпрОб.Код <> КодСпр ИЛИ СпрОб.ПолноеНаименование <> Наименование Тогда
			НадоИзменить = Истина;
		КонецЕсли; 
		
		Если НадоИзменить Тогда
			СпрОб.Код = КодСпр;
			СпрОб.Наименование = Наименование;
			СпрОб.ПолноеНаименование = Наименование;
			Попытка
				СпрОб.Записать();
			Исключение
			    аа = ОписаниеОшибки();
				Продолжить;
			КонецПопытки;
		КонецЕсли; 
		
	КонецЦикла;
	
	// -- Разделы ТН ВЭД
	
	// ++ Группы ТН ВЭД
	ТаблДок = СпрТН.ПолучитьМакет("тн2");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	Для сч = 1 По Всего Цикл
		
		КодРаздела 	 = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		КодГруппы    = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст);
		Наименование = СокрЛП(ТаблДок.Область(сч, 3, сч, 3).Текст);
		
		КодРодитель  = "РАЗДЕЛ " + СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(Число(КодРаздела), Ложь);
		
		СпрРодитель = СпрТН.НайтиПоКоду(КодРодитель);
		
		КодГруппы = Прав("00"+КодГруппы, 2);
		
		Найд = СпрТН.НайтиПоКоду(КодГруппы,, СпрРодитель);
		Если Найд = СпрПустая Тогда
			СпрОб = СпрТН.СоздатьГруппу();
		Иначе
			СпрОб = Найд.ПолучитьОбъект();
		КонецЕсли;
		
		НадоИзменить = Ложь;
		Если СпрОб.Код <> КодГруппы ИЛИ СпрОб.ПолноеНаименование <> Наименование ИЛИ СпрОб.Родитель <> СпрРодитель Тогда
			НадоИзменить = Истина;
		КонецЕсли; 
		
		Если НадоИзменить Тогда
			СпрОб.Код = КодГруппы;
			СпрОб.Родитель = СпрРодитель;
			СпрОб.Наименование = Наименование;
			СпрОб.ПолноеНаименование = Наименование;
			Попытка
				СпрОб.Записать();
			Исключение
			    аа = ОписаниеОшибки();
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	// -- Группы ТН ВЭД
	
	// ++ Товарные позиции ТН ВЭД
	ТаблДок = СпрТН.ПолучитьМакет("тн3");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	Для сч = 1 По Всего Цикл
		
		КодГруппы 	 = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		КодПозиции   = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст);
		Наименование = СокрЛП(ТаблДок.Область(сч, 3, сч, 3).Текст);
		
		КодРодитель  = Прав("00"+КодГруппы, 2);
		КодПозиции   = КодРодитель + Прав("00"+КодПозиции, 2);
		
		СпрРодитель = СпрТН.НайтиПоКоду(КодРодитель);
		
		Найд = СпрТН.НайтиПоКоду(КодПозиции,, СпрРодитель);
		Если Найд = СпрПустая Тогда
			СпрОб = СпрТН.СоздатьГруппу();
		Иначе
			СпрОб = Найд.ПолучитьОбъект();
		КонецЕсли;
		
		НадоИзменить = Ложь;
		Если СпрОб.Код <> КодПозиции ИЛИ СпрОб.ПолноеНаименование <> Наименование ИЛИ СпрОб.Родитель <> СпрРодитель Тогда
			НадоИзменить = Истина;
		КонецЕсли; 
		
		Если НадоИзменить Тогда
			СпрОб.Код = КодПозиции;
			СпрОб.Родитель = СпрРодитель;
			СпрОб.Наименование = Наименование;
			СпрОб.ПолноеНаименование = Наименование;
			Попытка
				СпрОб.Записать();
			Исключение
			    аа = ОписаниеОшибки();
				Продолжить;
			КонецПопытки;
		КонецЕсли; 
		
	КонецЦикла;
	// -- Товарные позиции ТН ВЭД
	
	// ++ Товарные подпозиции ТН ВЭДД
	ТаблДок = СпрТН.ПолучитьМакет("тн4");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	Для сч = 1 По Всего Цикл
		
		КодГруппы 	 = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		КодПозиции   = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст);
		КодПодПоз    = СокрЛП(ТаблДок.Область(сч, 3, сч, 3).Текст);
		Наименование = СокрЛП(ТаблДок.Область(сч, 4, сч, 4).Текст);
		
		Наименование = СокрЛП(СтрЗаменить(Наименование, "-", ""));
		
		КодРодитель  = Прав("00"+КодГруппы,2) + Прав("00"+КодПозиции, 2);
		
		КодПодПоз    = КодРодитель + КодПодПоз;
		
		СпрРодитель = СпрТН.НайтиПоКоду(КодРодитель);
		//КодПодПоз   = Прав("00"+КодПодПоз, 2);
		
		// чтобы не быол элементов без групп
		Если СпрРодитель.Пустая() Тогда
			Продолжить;
		КонецЕсли; 
		
		Найд = СпрТН.НайтиПоКоду(КодПодПоз,, СпрРодитель);
		Если Найд = СпрПустая Тогда
			СпрОб = СпрТН.СоздатьЭлемент();
		Иначе
			СпрОб = Найд.ПолучитьОбъект();
		КонецЕсли;
		
		НадоИзменить = Ложь;
		Если СпрОб.Код <> КодПодПоз ИЛИ СпрОб.ПолноеНаименование <> Наименование ИЛИ СпрОб.Родитель <> СпрРодитель Тогда
			НадоИзменить = Истина;
		КонецЕсли; 
		
		Если НадоИзменить Тогда
			СпрОб.Код = КодПодПоз;
			СпрОб.Родитель = СпрРодитель;
			СпрОб.Наименование = Наименование;
			СпрОб.ПолноеНаименование = Наименование;
			Попытка
				СпрОб.Записать();
			Исключение
			    аа = ОписаниеОшибки();
				Продолжить;
			КонецПопытки;
		КонецЕсли; 
		
	КонецЦикла;
	// -- Товарные подпозиции ТН ВЭД
	
КонецПроцедуры
 