////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Виды доступа Пользователи и ВнешниеПользователи уже заполнены.
// Их можно удалить, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Заказы";
	ВидДоступа.Представление = НСтр("ru = 'Заказы'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Заказы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Флоты";
	ВидДоступа.Представление = НСтр("ru = 'Флоты'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Флоты");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - массив структур, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - структура со свойствами:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Профиль "Администратор ИСС ЗИП-Э".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Администратор ИСС ЗИП-Э (АДМ)";
	ОписаниеПрофиля.Идентификатор = "cb58b13d-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Администратор ИСС ЗИП-Э (АДМ)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра справочной информации за исключением информации связанной с КТ,
		| - просмотра запросов/заявок на поставку за исключением информации связанной с КТ,
		| - изменения настроек интеграции с КСУ НСИ,
		| - просмотра журнала взаимодействия с КСУ НСИ,
		| - обмена данными с КСУ НСИ, Web-порталом инозаказчика, Контрагентами, ДЗО, РОЭ,
		| - администрирования пользователей и назначение прав доступа,
		| - просмотра журнала регистрации.
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("АдминистраторИСС_ЗИП_Э");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Открытие внешних отчетов и обработок".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Открытие внешних отчетов и обработок";
	ОписаниеПрофиля.Идентификатор = "1b3472f6-4d87-11e6-8264-5404a6a6895d";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Открытие внешних отчетов и обработок'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - предоставления доступа на открытие внешних отчетов и обработок.
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Представитель ДЗО-исполнителя заявки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Представитель ДЗО-исполнителя заявки (ПДЗО)";
	ОписаниеПрофиля.Идентификатор = "9a964e40-28ec-11e8-a99f-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Представитель ДЗО-исполнителя заявки (ПДЗО)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра запросов/заявок на поставку,
		| - изменения этапов заявки и позиции заявки.
		|Используется только в сочетании с ролями ППК и ПСК.
		|Имеет ограничение по организации.'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПредставительДЗОИсполнителяЗаявки");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Представитель контрагента".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Представитель контрагента (ПКА)";
	ОписаниеПрофиля.Идентификатор = "cb58b140-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Представитель контрагента (ПКА)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра предметов снабжения,
		| - редактирование реквизитов, спецификаций, технических характеристик, аналогов, ресурсов и сроков службы,
		|   регламетов ТОиР и внутренних цен предметов снабжения в статусе ""Новый"",
		| - просмотр и редактирование контрактов определяющих внутренние цены.
		|Имеет ограничение по организации.'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПредставительКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Представитель проектанта корабля".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Представитель проектанта корабля (ППК)";
	ОписаниеПрофиля.Идентификатор = "cb58b141-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Представитель проектанта корабля (ППК)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра справочной информации (без ограничений), за исключением информации связанной с КТ,
		| - редактирование реквизитов, спецификаций, технических характеристик, аналогов, ресурсов и сроков службы,
		|   регламетов ТОиР и внутренних цен предметов снабжения в статусе ""Новый"" (без ограничений),
		| - редактирования справочников: Организации, Характеристики ПС, Корабли, Боевые части, Помещения, 
		|   Структура корабля по комплектующим изделиям и ЗИП.
		|Имеет ограничение по кораблям. 
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПредставительПроектантаКорабля");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Заказы");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Представитель строителя корабля".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Представитель строителя корабля (ПСК)";
	ОписаниеПрофиля.Идентификатор = "cb58b142-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Представитель строителя корабля (ПСК)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра справочной информации (без ограничений), за исключением информации связанной с КТ,
		| - редактирование реквизитов, спецификаций, технических характеристик, аналогов, ресурсов и сроков службы,
		|   регламетов ТОиР и внутренних цен предметов снабжения в статусе ""Новый"" (без ограничений),
		| - редактирования справочников: Организации, Характеристики ПС, Корабли, Боевые части, Помещения, История ремонтов кораблей 
		|   Структура корабля по комплектующим изделиям и ЗИП включая экземпляры,
		| - Просмотра контрактов,
		| - Редактирования контрактов определяющих внутренние цены.
		|Имеет ограничение по кораблям. 
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПредставительСтроителяКорабля");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Заказы");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Представитель судоремонтного предприятия корабля".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Представитель судоремонтного предприятия корабля (ПСП)";
	ОписаниеПрофиля.Идентификатор = "cac8019d-28ec-11e8-a99f-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Представитель судоремонтного предприятия корабля (ПСП)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - Просмотра и редактирования экземпляров, истории ТОиР, наработка экземпляров и сязанных экземпляров.
		|Используется только в сочетании с ролями ППК и ПСК.
		|Имеет ограничение по кораблям. 
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПредставительСудоремонтногоПредприятияКорабля");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Заказы");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Руководитель департамента ВТС".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Руководитель департамента ВТС (РДВТС)";
	ОписаниеПрофиля.Идентификатор = "bd80c561-28ec-11e8-a99f-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Руководитель департамента ВТС (РДВТС)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра и редактирования запросов/заявок на поставку,
		| - изменения этапов заявки и позиции заявки.
		|Используется только в сочетании с ролью РВТС.
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("РуководительДепартаментаВТС");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ТолькоПросмотр"); // 18.04.2018
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Руководитель проекта департамента ВТС".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Руководитель проекта департамента ВТС (РВТС)";
	ОписаниеПрофиля.Идентификатор = "6757ddcf-28ec-11e8-a99f-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Руководитель проекта департамента ВТС (РВТС)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра справочной информации,
		| - изменения справочников: Организации, Корабли, Боевые части, Помещения, История ремонтов кораблей, 
		|   Структура корабля по комплектующим изделиям и ЗИП, 
		| - редактирование справочников: Иностранные заказчики, Предметы снабжения включая: спецификации, 
		|   технические характеристики, аналоги, ресурсы и сроки службы, регламеты ТОиР и внутренние цены (без ограничений),
		| - просмотра контрактов и внешних цен,
		| - просмотра и редактирования запросов/заявок на поставку, у которых пользователь указан в качестве руководителя проекта ВТС,
		| - изменения настроек интеграции с КСУ НСИ,
		| - просмотра журнала взаимодействия с КСУ НСИ,
		|Имеет ограничение по флотам. 
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("РуководительПроектаДепартаментаВТС");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Флоты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Руководитель проекта ИСС ЗИП-Э".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Руководитель проекта ИСС ЗИП-Э (РПС)";
	ОписаниеПрофиля.Идентификатор = "2e17bbda-28ec-11e8-a99f-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Руководитель проекта ИСС ЗИП-Э (РПС)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра и изменения внутренних справочников ИСС ЗИП-Э.
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("РуководительПроектаИССЗИПЭ");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Специалист блока закупок АО "ОСК"".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Специалист блока закупок АО ""ОСК"" (СБЗ)";
	ОписаниеПрофиля.Идентификатор = "cb58b145-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Специалист блока закупок АО ""ОСК"" (СБЗ)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра справочной информации (без ограничений) кроме: Организации, Корабли, Боевые части, Помещения, История ремонтов кораблей, 
		|   Структура корабля по комплектующим изделиям и ЗИП и информации связанной с КТ,
		| - редактирования таблицы поставщиков у предметов снабжения,
		| - Просмотра и редактирования контрактов (без ограничений).
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СпециалистБлокаЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Специалист департамента ГОЗ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Cпециалист департамента ГОЗ (СГОЗ)";
	ОписаниеПрофиля.Идентификатор = "cb58b13c-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Специалист департамента ГОЗ (СГОЗ)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра справочной информации (без ограничений), за исключением информации связанной с КТ,
		| - редактирование реквизитов, спецификаций, технических характеристик, аналогов, ресурсов и сроков службы,
		|   регламетов ТОиР и внутренних цен предметов снабжения в статусе ""Новый"" (без ограничений),
		| - редактирования справочников: Организации, Характеристики ПС, Корабли, Боевые части, Помещения, 
		|   Структура корабля по комплектующим изделиям и ЗИП включая экземпляры,
		| - Просмотра контрактов определяющих внутренние цены.
		|Имеет ограничение по Флотам. 
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("CпециалистДепартаментаГОЗ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Флоты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Специалист департамента экономики ОСК".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Специалист департамента экономики ОСК (СДЭ)";
	ОписаниеПрофиля.Идентификатор = "89cda739-28ec-11e8-a99f-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Специалист департамента экономики ОСК (СДЭ)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра запросов/заявок на поставку
		|Необходимо использовать в сочетании с другими ролями.
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СпециалистДепартаментаЭкономикиОСК");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Специалист по ведению БД ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Специалист по ведению БД (СБД)";
	ОписаниеПрофиля.Идентификатор = "cb58b146-24f0-11e7-a51d-0050568a1e48";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Специалист по ведению БД (СБД)'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для:
		| - просмотра и изменения справочной информации за исключением информации связанной с КТ.
		| - просмотра контрактов,
		| - обмена данными с КСУ НСИ,
		| - просмотра журнала регистрации.
		|'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СпециалистПоВедениюБД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПВзаимодействиеРОЭ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПФормированиеЗаявки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПКорректировкаСправочников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПРедактированиеСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБПДанныеПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Только просмотр".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Имя           = "Только просмотр";
	ОписаниеПрофиля.Идентификатор = "6182d2a9-0b2c-11e7-8a88-0050568a5b17";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Только просмотр'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для просмотра любых данных. 
		|Аналог полных прав без права редактирования.'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ТолькоПросмотр");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
	ПараметрыОбновления.ЗапретитьИзменениеПрофилей = Ложь;
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным:
// в пункте "2)" вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например, Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например, Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов, указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками, описание которых см. в комментарии
//                   к функции РегистрыСведений.НастройкиПравОбъектов.ВозможныеПрава().
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
