//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ОбменСПоставщиками

Функция ПолучитьМакет_ОбменаСПоставщиками_ПравилаЗаполненияИнформации() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_ПравилаЗаполненияИнформации");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_ПравилаЗаполненияИнформации

Функция ПолучитьМакет_ОбменаСПоставщиками_Аналоги() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_Аналоги");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_Аналоги

Функция ПолучитьМакет_ОбменаСПоставщиками_ТехническиеХарактеристики() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_ТехническиеХарактеристики");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_ТехническиеХарактеристики

Функция ПолучитьМакет_ОбменаСПоставщиками_ИнформацияПоИзделиям() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_ИнформацияПоИзделиям");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_ИнформацияПоИзделиям

#КонецОбласти

#Область Контракт

Функция ПолучитьМакет_Контракт_ТКПRusEng() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("Контракт_ТКПRusEng");
КонецФункции // ПолучитьМакет_Контракт_ТКПRusEng

#КонецОбласти