//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ОбменСПоставщиками

Функция ПолучитьМакет_ОбменаСПоставщиками_ПравилаЗаполненияИнформации() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_ПравилаЗаполненияИнформации");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_ПравилаЗаполненияИнформации

Функция ПолучитьМакет_ОбменаСПоставщиками_Аналоги() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_Аналоги");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_Аналоги

Функция ПолучитьМакет_ОбменаСПоставщиками_ТехническиеХарактеристики() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_ТехническиеХарактеристики");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_ТехническиеХарактеристики

Функция ПолучитьМакет_ОбменаСПоставщиками_ИнформацияПоИзделиям() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ОбменаСПоставщиками_ИнформацияПоИзделиям");
КонецФункции // ПолучитьМакет_ОбменаСПоставщиками_ИнформацияПоИзделиям

#КонецОбласти

#Область ВыгрузкаПСДляПоставщиков

Функция ПолучитьМакет_ВыгрузкаПСПоставщикам_ИнформацияПоИзделиям() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ВыгрузкаПСПоставщикам_ИнформацияПоИзделиям");
КонецФункции // ПолучитьМакет_ВыгрузкаПСПоставщикам_ИнформацияПоИзделиям

Функция ПолучитьМакет_ВыгрузкаПСПоставщикам_ТехническиеХарактеристики() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ВыгрузкаПСПоставщикам_ТехническиеХарактеристики");
КонецФункции // ПолучитьМакет_ВыгрузкаПСПоставщикам_ТехническиеХарактеристики

Функция ПолучитьМакет_ВыгрузкаПСПоставщикам_РегламентТОиР() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ВыгрузкаПСПоставщикам_РегламентТОиР");
КонецФункции // ПолучитьМакет_ВыгрузкаПСПоставщикам_РегламентТОиР

Функция ПолучитьМакет_ВыгрузкаПСПоставщикам_ПравилаЗаполнения() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("ВыгрузкаПСПоставщикам_ПравилаЗаполнения");
КонецФункции // ПолучитьМакет_ВыгрузкаПСПоставщикам_ПравилаЗаполнения

#КонецОбласти

#Область Контракт

Функция ПолучитьМакет_Контракт_ТКПRusEng() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("Контракт_ТКПRusEng");
КонецФункции // ПолучитьМакет_Контракт_ТКПRusEng

Функция ПолучитьМакет_Контракт_ПриложениеКПисьмуФСВТС() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("Контракт_ПриложениеКПисьмуФСВТС");
КонецФункции // ПолучитьМакет_Контракт_ПриложениеКПисьмуФСВТС

Функция ПолучитьМакет_Контракт_ПисьмоТКПEng() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("Контракт_ПисьмоТКПEng");	
КонецФункции // ПолучитьМакет_Контракт_ПисьмоТКПEng

#КонецОбласти

#Область Заявка

Функция ПолучитьМакет_Заявка_ПриложениеКПисьмуФСВТС() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("Заявка_ПриложениеКПисьмуФСВТС");
КонецФункции // ПолучитьМакет_Заявка_ПриложениеКПисьмуФСВТС

Функция ПолучитьМакет_Заявка_ПисьмоФСВТС() Экспорт
	Возврат Обработки.ХранилищеМакетов.ПолучитьМакет("Заявка_ПисьмоФСВТС");	
КонецФункции // ПолучитьМакет_Заявка_ПисьмоФСВТС

#КонецОбласти