//++ 02.10.2017 Веденеев П. - процедуры вызова удаления дубликатов
&НаКлиенте
Процедура УдалитьДубликаты(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() < 2 Тогда
		
		ПоказатьПредупреждение(, "Выбрано менее двух элементов!");
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Дубликаты", Элементы.Список.ВыделенныеСтроки);
	ПараметрыОткрытия.Вставить("ОригинальныйЭлемент", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикУдаленияДубликатов", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", Элементы.Список.ВыделенныеСтроки));
	
	ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикУдаленияДубликатов(УдалениеПроизведено, ДопПараметры) Экспорт

	Если УдалениеПроизведено = Истина Тогда
	
		Элементы.Список.Обновить();	
		
		Для каждого ЭлементСправочника Из ДопПараметры.ВыделенныеСтроки Цикл
		
			Если Не ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(ЭлементСправочника, "ПометкаУдаления") Тогда
			
				Элементы.Список.ТекущаяСтрока = ЭлементСправочника;
				Прервать;
			
			КонецЕсли;	
		
		КонецЦикла;
	
	КонецЕсли;	

КонецПроцедуры
//-- 02.10.2017 Веденеев П. - процедуры вызова удаления дубликатов
