
Процедура ЗаписатьВЛог(ГУИД, Ссылка, ПутьКФайлу="", ИдентификаторСтроки=Неопределено, Описание="", СтруктураДанных=Неопределено) Экспорт
	
	// возврат;
	
	МЗ = РегистрыСведений.ЛогЗагрузки.СоздатьМенеджерЗаписи();
	МЗ.ГУИД = ГУИД;
	МЗ.Файл = "";
	МЗ.ПутьКФайлу = ПутьКФайлу;
	МЗ.Объект1С = Ссылка;
	МЗ.Период = ТекущаяДата();
	МЗ.ИдентификаторСтроки = ИдентификаторСтроки;
	МЗ.Описание = Описание;
	МЗ.СтруктураДанных = СтруктураДанных;
	Попытка
		МЗ.Записать(Истина);
	Исключение
	    ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры



// Добавляет предмет снабжения в очередь для обновления наименований КомплектующихИзделийИЗИП
//
Процедура ДоавитьВОчередьОбновленияНаименованийКомплектующихИзделийИЗИП(Дата, ПредметСнабжения) Экспорт
	
	ОчередьМенеджерЗаписи = РегистрыСведений.ОчередьОбновленияНаименованийКомплектующихИзделийИЗИП.СоздатьМенеджерЗаписи();
	ОчередьМенеджерЗаписи.Период = Дата;
	ОчередьМенеджерЗаписи.ПредметСнабжения = ПредметСнабжения;
	ОчередьМенеджерЗаписи.Записать();
	
КонецПроцедуры

// Получает значение доступа из группы по текущему пользователю
//
Функция ПолучитьЗначениеДоступа(Пользователь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка,
	|	ЗначенияГруппДоступа.ЗначениеДоступа КАК ЗначениеДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияГруппДоступа КАК ЗначенияГруппДоступа
	|		ПО ГруппыДоступаПользователи.Ссылка = ЗначенияГруппДоступа.ГруппаДоступа
	|			И (ЗначенияГруппДоступа.ЗначениеРазрешено)
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Массив.Добавить(Выборка.ЗначениеДоступа);
		
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции
   