
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	ПоказатьРеквизиты = Не Форма.Элементы.ПредметыСнабженияНаименованиеБД.Видимость;
	
	Форма.Элементы.ПредметыСнабженияНаименованиеБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияОбозначениеБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияДокументНаПоставкуБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияВозможностьИзготовленияБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияСрокИзготовленияБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияЦенаБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияДатаЦеныБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ПредметыСнабженияПравилаУпаковкиТранспортировкиХраненияБД.Видимость = ПоказатьРеквизиты;
	
	Форма.Элементы.ХарактеристикиЕдиницаИзмеренияБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ХарактеристикиЗначениеБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ХарактеристикиОсновнаяБД.Видимость = ПоказатьРеквизиты;
		
	Форма.Элементы.ХарактеристикиПредметаСнабженияЕдиницаИзмеренияБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ХарактеристикиПредметаСнабженияЗначениеБД.Видимость = ПоказатьРеквизиты;
	Форма.Элементы.ХарактеристикиПредметаСнабженияОсновнаяБД.Видимость = ПоказатьРеквизиты;
	
КонецПроцедуры

Функция ЕстьСвойство(ВладелецСвойства, ИмяСвойства) Экспорт
	
	Структура = Новый Структура(ИмяСвойства, Неопределено);
	ЗаполнитьЗначенияСвойств(Структура, ВладелецСвойства);
	
	Возврат Не Структура[ИмяСвойства] = Неопределено;
	
КонецФункции
