
/////// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ЭкспортныеПроцедурыИФункции


Процедура ВыгрузитьСерверМодульОбъекта(ПараметрыВыгрузки) ЭКСПОРТ  
	ВременныйКаталогДляКартинок = ПараметрыВыгрузки.Директория;
	СтруктураПакетовЗапроса 	= ОбменССайтом.СобратьОсновнойЗапрос(ПараметрыВыгрузки);
	Если ПараметрыВыгрузки.СформироватьАрхивНаСервере Тогда
		Если ПараметрыВыгрузки.ВыгружатьФайлы Тогда
			ТЗВложений = СтруктураПакетовЗапроса.Attachment.Выгрузить();
			ТЗВложений.Свернуть("id");
			МассивФЗ = ВыгрузитьНаСервереФоном(ТЗВложений.ВыгрузитьКолонку("id"), ПараметрыВыгрузки);
		Иначе
			МассивФЗ = ВыгрузитьНаСервереФоном(Новый Массив, ПараметрыВыгрузки);
		КонецЕсли;
		//СформироватьФайлJSON(СтруктураПакетовЗапроса, ПараметрыВыгрузки);
		ФоновыеЗадания.ОжидатьЗавершения(МассивФЗ);
		УпаковатьФайлыВАрхив(ПараметрыВыгрузки.ПутьКФайлу, ПараметрыВыгрузки.Директория, ПараметрыВыгрузки.ДиректорияJS);
		Сообщить(Формат(ТекущаяДата(),"ДЛФ=ДВ") + " - Окончание выгрузки.");
	Иначе
		Если ПараметрыВыгрузки.ВыгружатьФайлы Тогда
			ТЗВложений = СтруктураПакетовЗапроса.Attachment.Выгрузить();
			ТЗВложений.Свернуть("id");
			ПараметрыВыгрузки.Вставить("МассивФайлов", ТЗВложений.ВыгрузитьКолонку("id"));	
		КонецЕсли;
		ОбменССайтом.СформироватьФайлJSON(ПараметрыВыгрузки);
		УдалитьФайлы(ВременныйКаталогДляКартинок);
	КонецЕсли;	
КонецПроцедуры // ВыгрузитьСерверМодульОбъекта

#КонецОбласти

///////////////////////////////////////////////////////////



/////// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ВспомогательныеПроцедурыИФункции

Процедура УпаковатьФайлыВАрхив(ПутьКФайлу, Директория, ПутьКJS)
	
	Попытка
		УдалитьФайлы(Директория, "Thumbs.db");
	Исключение
		Сообщить("Не удалось удалить файлы, попробуйте вручную");
	КонецПопытки;
	Архив = Новый ЗаписьZipФайла(ПутьКФайлу,,,МетодСжатияZIP.Копирование, УровеньСЖатияZIP.Минимальный);
	//Архив.Добавить(Директория + "*.gif", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	//Архив.Добавить(Директория + "*.tif", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	//Архив.Добавить(Директория + "*.png", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	//Архив.Добавить(Директория + "*.tiff", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	//Архив.Добавить(Директория + "*.jpg", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	//Архив.Добавить(Директория + "*.jpeg", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	//Архив.Добавить(Директория + "*.bmp", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	Архив.Добавить(Директория + "*.*", РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	Архив.Добавить(ПутьКJS, РежимСохраненияПутейZIP.НеСохранятьПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);

	Архив.Записать();
	Попытка
		УдалитьФайлы(Директория);
		УдалитьФайлы(ПутьКJS);
	Исключение
		Сообщить("Не удалось удалить файлы, попробуйте вручную");
	КонецПопытки
	
КонецПроцедуры  //УпаковатьФайлыВАрхив 

Функция ВыгрузитьНаСервереФоном(МассивФайлов, ПараметрыВыгрузки)
	
	АдресХранилищаКонечногоФайла = ПараметрыВыгрузки.АдресХранилищаКонечногоФайла;
	
	Директория = ПараметрыВыгрузки.Директория;
	
	КлючЗадания	= Новый УникальныйИдентификатор();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыВыгрузки); 
	
	МассивФЗ = Новый Массив;
	
	Задание = ФоновыеЗадания.Выполнить("ОбменССайтом.СформироватьФайлJSON", МассивПараметров, КлючЗадания, "Выгрузка JSON");
	МассивФЗ.Добавить(Задание);
	
	ОбщееКоличествоЭлементов = МассивФайлов.Количество();
	
	Порция = Цел(ОбщееКоличествоЭлементов/ПараметрыВыгрузки.КоличествоФоновыхЗаданий);
	
	Если ПараметрыВыгрузки.ВыгружатьФайлы Тогда
		
		МассивДляОтправкиДанных = Новый Массив;
		Счетчик = 0;
		
		Для Каждого ПрисФайл из МассивФайлов Цикл
			Индекс = МассивФайлов.Найти(ПрисФайл);
			
			Если Счетчик < Порция И Индекс <> ОбщееКоличествоЭлементов - 1 Тогда
				МассивДляОтправкиДанных.Добавить(ПрисФайл);
				Счетчик = Счетчик + 1;
				
			Иначе
				КлючЗадания = Новый УникальныйИдентификатор();
				
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(Директория);
				МассивПараметров.Добавить(МассивДляОтправкиДанных);
				
				Задание = ФоновыеЗадания.Выполнить("ОбменССайтом.ВыгрузитьПрисоединенныеФайлыВДиректорию", МассивПараметров, КлючЗадания, "Выгрузка картинок");
				МассивФЗ.Добавить(Задание);
				
				МассивДляОтправкиДанных.Очистить();
				МассивДляОтправкиДанных.Добавить(ПрисФайл);
				
				Счетчик = 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат МассивФЗ;
	
КонецФункции //ВыгрузитьНаСервереФоном

#КонецОбласти

/////////////////////////////////////////////////////////////