
Процедура ПередЗаписью(Отказ)
	
	ПроверитьУникальностьНаименования = Ложь;
	
	Если ЭтоНовый() Тогда
	
		ПроверитьУникальностьНаименования = Истина;	
	
	Иначе
		
		ПроверитьУникальностьНаименования = Не ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "Наименование") = Наименование;	
		
	КонецЕсли;
	
	Если ПроверитьУникальностьНаименования Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	БоевыеЧасти.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БоевыеЧасти КАК БоевыеЧасти
		|ГДЕ
		|	БоевыеЧасти.Наименование = &Наименование
		|	И НЕ БоевыеЧасти.Ссылка = &Ссылка
		|	И БоевыеЧасти.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			Сообщить("Краткое наименование боевой части не уникально!");
			Возврат;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ПроверитьУникальностьПолногоНаименования = Ложь;
	
	Если ЭтоНовый() Тогда
	
		ПроверитьУникальностьПолногоНаименования = Истина;	
	
	Иначе
		
		ПроверитьУникальностьПолногоНаименования = Не ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "ПолноеНаименование") = ПолноеНаименование;	
		
	КонецЕсли;
	
	Если ПроверитьУникальностьПолногоНаименования Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	БоевыеЧасти.Ссылка
		|ИЗ
		|	Справочник.БоевыеЧасти КАК БоевыеЧасти
		|ГДЕ
		|	БоевыеЧасти.ПолноеНаименование = &ПолноеНаименование
		|	И НЕ БоевыеЧасти.Ссылка = &Ссылка
		|	И БоевыеЧасти.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("ПолноеНаименование", ПолноеНаименование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			Сообщить("Полное наименование боевой части не уникально!");
			Возврат;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры
