

////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбъектВОчередьОбновленияПоисковогоИндекса(Объект, ОписаниеОшибки = "", КоличествоПопыток = 0) Экспорт
	
	Запись = РегистрыСведений.ОчередьОбновленияИндекса.СоздатьМенеджерЗаписи();
	
	Запись.Объект = Объект;
	Запись.Дата   = ТекущаяДата();
	Запись.ОписаниеОшибки = ОписаниеОшибки;	
	Запись.КоличествоПопыток = Запись.КоличествоПопыток + КоличествоПопыток;
	
	Запись.Записать();
	
КонецПроцедуры //ДобавитьОбъектВОчередьОбновленияПоисковогоИндекса

Процедура УдалитьОбъектИзОчередиОбновленияПоисковогоИндекса(Объект) Экспорт
	
	Запись = РегистрыСведений.ОчередьОбновленияИндекса.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Прочитать();	
	Запись.Удалить();
	
КонецПроцедуры //ДобавитьОбъектВОчередьОбновленияПоисковогоИндекса

#КонецОбласти