//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ВремяХраненияВКеше() Экспорт
	ВремяХраннения	= Справочники.НастройкиОбменаСХранилищемФайлов.Основная.ВремяХраненияВКеше;
	Если ВремяХраннения = 0 Тогда
		ВремяХраннения = 24;
	КонецЕсли; // Если ВремяХраннения = 0 Тогда
	Возврат ВремяХраннения;
КонецФункции // ВремяХраненияВКеше

/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ