///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ДобавитьЗапись(Объект, ТипЗапроса, ПочтовоеСообщение) Экспорт
	Идентификатор				= Новый УникальныйИдентификатор;
	Запись 						= РегистрыСведений.ЗапросыКНСИ.СоздатьМенеджерЗаписи();
	Запись.Объект 				= Объект; 	
	Запись.Идентификатор 		= Идентификатор;
	Запись.ТипЗапроса 			= ТипЗапроса;
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Записать();
	Возврат Идентификатор;
КонецФункции // ДобавитьЗапись
