
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Сначала нужно записать элемент!");
		Возврат;
		
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник), 
		"Будет включен режим изменения реквизитов. Прочие изменения станут невозможны. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, Форма) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаВнестиИзмененияВСправочник.Видимость = Ложь;
		Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаАкцептоватьИзмененияВСправочнике.Видимость = Истина;
		
		Если Не Форма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаЗаписать") = Неопределено Тогда
			
			Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписать.Видимость = Ложь;
			
		КонецЕсли;
		
		Если Не Форма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ЗаписатьПрограммно") = Неопределено Тогда
			
			Форма.КоманднаяПанель.ПодчиненныеЭлементы.ЗаписатьПрограммно.Видимость = Ложь;
			
		КонецЕсли;
		
		Для каждого ЭлементФормы Из Форма.Элементы Цикл
			
			Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
				
				Если (ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Или ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка) 
					И ЭлементФормы.ТекстПодвала = "ЭтоРеквизитОбъекта" Тогда
					
					ЭлементФормы.ТолькоПросмотр = Ложь;
					
				ИначеЕсли ЭлементФормы.Имя = "ФНН" Тогда //исключения
					
					ЭлементФормы.ТолькоПросмотр = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") И ЭлементФормы.Имя = "НРЕГ" Тогда //исключения
				
				ЭлементФормы.Доступность = Истина;
				
			ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Или ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
				
				ЭлементФормы.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Сообщить("Действие отменено");
		
	КонецЕсли;
	
КонецПроцедуры
