
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СписокРеквизитов", СписокРеквизитов);
	
	Если Параметры.Свойство("СписокПометок") Тогда
		
		Для каждого ЭлементСпискаРеквизитов Из СписокРеквизитов Цикл
			
			ЭлементСпискаРеквизитов.Пометка = (Не Параметры.СписокПометок.НайтиПоЗначению(ЭлементСпискаРеквизитов.Значение) = Неопределено);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СписокРеквизитов);
	
КонецПроцедуры
