
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаДляСпецификацииПрямой() Экспорт
	
	КоличествоЦиклов = Константы.МаксимальноеКоличествоУровнейВложенностиСпецификации.Получить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СпецификацииПС.ПредметСнабжения КАК ПредметСнабжения,
	|	СпецификацииПС.СоставляющаяЧасть КАК СоставляющаяЧасть,
	|	СпецификацииПС.ЗИП КАК ЗИП,
	|	СпецификацииПС.Количество КАК Количество,
	|	СпецификацииПС.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	СпецификацииПС.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	СпецификацииПС.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	|	СпецификацииПС.КоличествоВЗИПР КАК КоличествоВЗИПР,
	|	СпецификацииПС.НомерПозиции КАК НомерПозиции,
	|	СпецификацииПС.Тип КАК Тип
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	РегистрСведений.СпецификацииПС КАК СпецификацииПС
	|ГДЕ
	|	СпецификацииПС.ПредметСнабжения = &ПредметСнабжения
	|;";
	
	Для Н = 1 По КоличествоЦиклов - 1 Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ВТ_" + Н + ".СоставляющаяЧасть КАК ПредметСнабжения,
		|	СпецификацииПС.СоставляющаяЧасть КАК СоставляющаяЧасть,
		|	СпецификацииПС.ЗИП КАК ЗИП,
		|	СпецификацииПС.Количество КАК Количество,
		|	СпецификацииПС.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
		|	СпецификацииПС.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
		|	СпецификацииПС.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
		|	СпецификацииПС.КоличествоВЗИПР КАК КоличествоВЗИПР,
		|	СпецификацииПС.НомерПозиции КАК НомерПозиции,
		|	СпецификацииПС.Тип КАК Тип		
		|ПОМЕСТИТЬ ВТ_" + (Н + 1) + "
		|ИЗ
		|	ВТ_" + Н + " КАК ВТ_" + Н + "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииПС КАК СпецификацииПС
		|		ПО ВТ_" + Н + ".СоставляющаяЧасть = СпецификацииПС.ПредметСнабжения
		|;
		|";
		
	КонецЦикла;	
	
	СтрокаОбъединитьВсе = "";
	СтрокаПоместить = "ПОМЕСТИТЬ ВТ_Спецификация";
	
	Для Н = 1 По КоличествоЦиклов Цикл
		
		ТекстЗапроса = ТекстЗапроса + СтрокаОбъединитьВсе + "
		|
		|ВЫБРАТЬ
		|	ВТ_" + Н + ".ПредметСнабжения КАК ПредметСнабжения,
		|	ВТ_" + Н + ".СоставляющаяЧасть КАК СоставляющаяЧасть,
		|	ВТ_" + Н + ".ЗИП КАК ЗИП,
		|	ВТ_" + Н + ".Количество КАК Количество,
		|	ВТ_" + Н + ".КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
		|	ВТ_" + Н + ".КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
		|	ВТ_" + Н + ".КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
		|	ВТ_" + Н + ".КоличествоВЗИПР КАК КоличествоВЗИПР,
		|	ВТ_" + Н + ".НомерПозиции КАК НомерПозиции,
		|	ВТ_" + Н + ".Тип КАК Тип
		
		|" + СтрокаПоместить + "
		|ИЗ
		|	ВТ_" + Н + " КАК ВТ_" + Н + "
		|
		|";
		
		СтрокаПоместить = "";
		СтрокаОбъединитьВсе = "ОБЪЕДИНИТЬ ВСЕ";

	КонецЦикла;	
	
	Для Н = 1 По КоличествоЦиклов Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|УНИЧТОЖИТЬ ВТ_" + Н + "
		|
		|";
		
		СтрокаОбъединитьВсе = "ОБЪЕДИНИТЬ ВСЕ";

	КонецЦикла;	

	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДляСпецификацииПрямой()

Функция ПолучитьТекстЗапросаДляСпецификации() Экспорт
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляСпецификацииПрямой();

	ТекстЗапроса = ТекстЗапроса + "
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Спецификация.ПредметСнабжения КАК ПредметСнабжения,
	|	ВТ_Спецификация.СоставляющаяЧасть КАК СоставляющаяЧасть,
	|	ВТ_Спецификация.ЗИП КАК ЗИП,
	|	ВТ_Спецификация.Количество КАК Количество,
	|	ВТ_Спецификация.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	ВТ_Спецификация.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	ВТ_Спецификация.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	|	ВТ_Спецификация.КоличествоВЗИПР КАК КоличествоВЗИПР,
	|	ВТ_Спецификация.НомерПозиции КАК НомерПозиции,
	|	ВТ_Спецификация.Тип КАК Тип
	|ИЗ
	|	ВТ_Спецификация КАК ВТ_Спецификация
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДляСпецификации()

#КонецОбласти 
