
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерПозиции", НомерПозиции); //++ 16.05.2018 Веденеев П.
	Параметры.Свойство("СоставляющаяЧасть", СоставляющаяЧасть);
	Параметры.Свойство("ЗИП", ЗИП);
	Параметры.Свойство("Тип", Тип);
	Параметры.Свойство("Количество", Количество);
	Параметры.Свойство("ОбозначениеСНК", ОбозначениеСНК);
	Параметры.Свойство("ПричинаВыбораДляЗИП", ПричинаВыбораДляЗИП);
	Параметры.Свойство("УказательНаЭлементСхемы", УказательНаЭлементСхемы);
	Параметры.Свойство("Взаимозаменяемость", Взаимозаменяемость);
	Параметры.Свойство("ПризнакПодбора", ПризнакПодбора);
	Параметры.Свойство("ОбозначениеЗаготовки", ОбозначениеЗаготовки);
	Параметры.Свойство("СведенияОбИзменениях", СведенияОбИзменениях);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатПроверкиЗаполненияРеквизитов = ПроверитьЗаполнениеРеквизитов();
	
	Если РезультатПроверкиЗаполненияРеквизитов.ЕстьЗамечания Тогда
	
		Отказ = Истина;
		Сообщить(РезультатПроверкиЗаполненияРеквизитов.Описание);
		Возврат;
	
	КонецЕсли;
	
	СтруктураЗакрытия = Новый Структура();
	
	СтруктураЗакрытия.Вставить("НомерПозиции", НомерПозиции); //++ 16.05.2018 Веденеев П.
	СтруктураЗакрытия.Вставить("СоставляющаяЧасть", СоставляющаяЧасть);
	СтруктураЗакрытия.Вставить("ЗИП", ЗИП);
	СтруктураЗакрытия.Вставить("Тип", Тип);
	СтруктураЗакрытия.Вставить("Количество", Количество);
	СтруктураЗакрытия.Вставить("ОбозначениеСНК", ОбозначениеСНК);
	СтруктураЗакрытия.Вставить("ПричинаВыбораДляЗИП", ПричинаВыбораДляЗИП);
	СтруктураЗакрытия.Вставить("УказательНаЭлементСхемы", УказательНаЭлементСхемы);
	СтруктураЗакрытия.Вставить("Взаимозаменяемость", Взаимозаменяемость);
	СтруктураЗакрытия.Вставить("ПризнакПодбора", ПризнакПодбора);
	СтруктураЗакрытия.Вставить("ОбозначениеЗаготовки", ОбозначениеЗаготовки);
	СтруктураЗакрытия.Вставить("СведенияОбИзменениях", СведенияОбИзменениях);
	СтруктураЗакрытия.Вставить("Обозначение", ПолучитьОбозначение(СоставляющаяЧасть));
	
	Закрыть(СтруктураЗакрытия);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбозначение(ПредметСнабжения)
	
	Возврат ПредметСнабжения.Обозначение;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	Результат = Новый Структура("ЕстьЗамечания, Описание", Ложь, "");

	МассивЗамечаний = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СоставляющаяЧасть) Тогда
	
		МассивЗамечаний.Добавить("Не заполнена составная часть.");
		МассивЗамечаний.Добавить(Символы.ПС);	
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Тип) Тогда
	
		МассивЗамечаний.Добавить("Не заполнен тип.");
		МассивЗамечаний.Добавить(Символы.ПС);	
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Количество) Тогда
	
		МассивЗамечаний.Добавить("Не заполнено количество.");
		МассивЗамечаний.Добавить(Символы.ПС);	
		
	КонецЕсли;
	
	// ++ 30.08.2018 14:22:47 Базунов Д.А. Задача: 
	//Если Не ЗначениеЗаполнено(ПричинаВыбораДляЗИП) Тогда
	//
	//	МассивЗамечаний.Добавить("Не заполнена причина выбора для ЗИП.");
	//	МассивЗамечаний.Добавить(Символы.ПС);	
	//	
	//КонецЕсли;			
	// -- 30.08.2018 14:22:47 Базунов Д.А. Задача:
	
	Если МассивЗамечаний.Количество() > 0 Тогда
		
		МассивЗамечаний.Удалить(МассивЗамечаний.Количество() - 1);
		Результат.Описание = СтрСоединить(МассивЗамечаний);
		Результат.ЕстьЗамечания = Истина;
		 
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПроверитьЗаполнениеРеквизитов()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗИППриИзменении(Элемент)
	
	//++ 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
	Если ЗИП И ИмеетсяСпецификация(СоставляющаяЧасть) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриИзмененииЗИП", ЭтаФорма), 
			"Спецификация элемента будет удалена из структуры заказа (включая данные о количестве). Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПриИзмененииЗИП(КодВозвратаДиалога.Да, Неопределено);
		
	КонецЕсли;
	//-- 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
	
КонецПроцедуры

//++ 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
&НаСервереБезКонтекста
Функция ИмеетсяСпецификация(ПредметСнабжения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацииПредметовСнабжения.СоставляющаяЧасть КАК СоставляющаяЧасть
	|ИЗ
	|	РегистрСведений.СпецификацииПредметовСнабжения КАК СпецификацииПредметовСнабжения
	|ГДЕ
	|	СпецификацииПредметовСнабжения.ПредметСнабжения = &ПредметСнабжения";
	Запрос.УстановитьПараметр("ПредметСнабжения", ПредметСнабжения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииЗИП(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		ЗИП = Ложь;
		Сообщить("Действие отменено!");
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры
//-- 19.02.2018 Веденеев П. //если установлен флаг ЗИП, но предмет снабжения имеет спецификацию - запрашиваем подтверждение действия
