//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
//
// Функция ПрочитатьФайлВТабличныйДокумент
//
// Описание: Читает файл на сервере через ТабличныйДокумент.Прочитать()
//
//
// Параметры:
//  АдресВременногоХранилища - Строка - Адрес файла во временном хранилище
//  ПараметрыФайла     - Структура - необязательный параметр,
//                       содержит информацию о расширении файла.
//
// Возвращаемое значение: табличный документ или неопределено 
//
Функция ПрочитатьФайлВТабличныйДокумент(АдресВременногоХранилища, ПараметрыФайла = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Если ПараметрыФайла = Неопределено Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	Иначе
		ИмяФайла = ПолучитьИмяВременногоФайла(ПараметрыФайла.Расширение);
	КонецЕсли; // Если ПараметрыФайла = Неопределено Тогда
	
	ДанныеФайла.Записать(ИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		ТабличныйДокумент.Прочитать(ИмяФайла);
		// Возвращаем первый лист
		Если ТабличныйДокумент.Области.Количество() > 0 Тогда
			Результат = ТабличныйДокумент.ПолучитьОбласть(ТабличныйДокумент.Области[0].Имя);
		Иначе
			Результат = ТабличныйДокумент; 
		КонецЕсли; // Если ТабличныйДокумент.Области.Количество() > 0 Тогда
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать файл");
		Возврат Результат;
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат	Результат;
	
КонецФункции // ПрочитатьФайлВТабличныйДокумент
