////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДокОбъект, ДокСсылка)
	
	ВзаимодействиеСРОЭ.ЗаполнитьДанныеНаСервере(ДокОбъект, ДокСсылка);
	
	ДокОбъект.ВариантЗаполнения = 2;
	
КонецПроцедуры

////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаМастерЗагрузки(Команда)
	ОткрытьФорму("Обработка.спЗагрузкаЗаявок.Форма.Форма");
КонецПроцедуры // КомандаМастерЗагрузки

&НаКлиенте
Процедура ОтправитьРОЭ(Команда)
	
	ФормаБП = ПолучитьФорму("БизнесПроцесс.ВзаимодействиеСРОЭ.Форма.ФормаБизнесПроцесса");
    ДокОбъект = ФормаБП.Объект;
	
	ДокСсылка = Элементы.Список.ТекущаяСтрока;

	ЗаполнитьДанныеНаСервере(ДокОбъект, ДокСсылка);
    КопироватьДанныеФормы(ДокОбъект, ФормаБП.Объект);
	
	ФормаБП.Открыть();
		
КонецПроцедуры // ОтправитьРОЭ


////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
		Элементы.ФормаВыбрать.Видимость = Истина;
		Элементы.ФормаВыбрать.КнопкаПоУмолчанию = Истина;
		Элементы.ФормаСоздать.Видимость = Ложь;
	КонецЕсли; 
	
	// ++ 11.07.2018 16:40:40 Базунов Д.А. Задача: 
	Элементы.ФормаОтправитьРОЭ.Видимость = ПравоДоступа("ИнтерактивныйСтарт", Метаданные.БизнесПроцессы.ВзаимодействиеСРОЭ);
	// -- 11.07.2018 16:40:40 Базунов Д.А. Задача:
	
КонецПроцедуры


