///////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьОписание(ЭлементСтруктуры) Экспорт
	Результат 		= "";
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП.ОписаниеИерархии КАК Описание
	             	  |ИЗ
	             	  |	РегистрСведений.ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП КАК ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП
	             	  |ГДЕ
	             	  |	ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП.ЭлементСтруктуры = &ЭлементСтруктуры";
	Запрос.УстановитьПараметр("ЭлементСтруктуры", ЭлементСтруктуры);
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Описание;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	Возврат Результат;
КонецФункции // ПолучитьОписание
