
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПредметСнабжения", ТекущиеДанные.Ссылка);
	ДопПараметры.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ЕдиницаИзмерения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикДобавленияВПодбор", ЭтотОбъект, ДопПараметры); 
	
	ОткрытьФорму("Справочник.КаталогПредметовСнабжения.Форма.ФормаДобавленияВПодбор", ДопПараметры, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДобавленияВПодбор(Количество, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Количество) Тогда
	
		НоваяСтрока = ВыбранныеПредметыСнабжения.Добавить();
		НоваяСтрока.Включить 			= Истина;
		НоваяСтрока.ПредметСнабжения 	= ДопПараметры.ПредметСнабжения;
		НоваяСтрока.Количество 			= Количество;
		НоваяСтрока.ЕдиницаИзмерения 	= ДопПараметры.ЕдиницаИзмерения;
	
	КонецЕсли;	

КонецПроцедуры // ОбработчикДобавленияВПодбор()

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ПолучитьАдресВременногоХранилища(ВладелецФормы.УникальныйИдентификатор));	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВременногоХранилища(Адрес)

	Возврат ПоместитьВоВременноеХранилище(ВыбранныеПредметыСнабжения.Выгрузить(), Адрес);	

КонецФункции // ПолучитьАдресВременногоХранилища()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();	
	
КонецПроцедуры



