
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаПС") Тогда
		
		Найдено = Объект.Цены.НайтиСтроки(Новый Структура("ПредметСнабжения", Параметры.СсылкаПС));
		
		Если Найдено.Количество() > 0 Тогда
			
			Элементы.Цены.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловиеПоставкиНаСервере()
	
	ДопИнформация = Объект.ДополнительнаяИнформация;
	
	Для каждого Стр Из Объект.Цены Цикл
		
		Если Стр.УсловиеПоставки = "" Тогда
			Стр.УсловиеПоставки = ДопИнформация;
		Иначе
			Если ПерезаписатьСуществующие Тогда	
				Стр.УсловиеПоставки = ДопИнформация;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУсловиеПоставки(Команда)
	
	ЗаполнитьУсловиеПоставкиНаСервере();
	
КонецПроцедуры
