////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьICAT(ПредметСнабжения) Экспорт
	Результат = "";
	Если Не ЗначениеЗаполнено(ПредметСнабжения) Тогда
		Возврат Результат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(ПредметСнабжения) Тогда
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	КодыINCATПредставление.Представление КАК Представление
	             	  |ИЗ
	             	  |	РегистрСведений.КодыINCATПредставление КАК КодыINCATПредставление
	             	  |ГДЕ
	             	  |	КодыINCATПредставление.ПредметСнабжения = &ПредметСнабжения";
	Запрос.УстановитьПараметр("ПредметСнабжения", ПредметСнабжения);
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Представление;
	КонецЕсли; // Если Выборка.Следующий() Тогда	
	Возврат Результат;
КонецФункции // ПолучитьICAT
