////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ДобавитьЗапись(Объект, ТипЗапроса, ПочтовоеСообщение, Описание = "") Экспорт
	Идентификатор 				= Новый УникальныйИдентификатор;
	Запись 						= РегистрыСведений.ОтветыНСИ.СоздатьМенеджерЗаписи();
	Запись.Объект 				= Объект;
	Запись.Идентификатор 		= Идентификатор;
	Запись.ТипЗапроса 			= ТипЗапроса;
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Описание 			= Описание;
	Запись.Записать();
	Возврат Идентификатор;
КонецФункции // ДобавитьЗапись
