
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СписокРеквизитов", СписокРеквизитов);
	
	//++ 02.10.2017 Веденеев П. //заполнение списка реквизитов, значения которых будут сохранены при объединении
	Если Параметры.Свойство("СписокПометок") Тогда
		
		Для каждого ЭлементСпискаРеквизитов Из СписокРеквизитов Цикл
			
			ЭлементСпискаРеквизитов.Пометка = (Не Параметры.СписокПометок.НайтиПоЗначению(ЭлементСпискаРеквизитов.Значение) = Неопределено);
			
		КонецЦикла;
		
	КонецЕсли;
	//-- 02.10.2017 Веденеев П. //заполнение списка реквизитов, значения которых будут сохранены при объединении
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СписокРеквизитов);
	
КонецПроцедуры
