
&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьЗавершение", ЭтаФорма), "Регистр будет полностью перезаполнен. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Сообщить("Корректировка описаний иерархий начата в " + ТекущаяДата());
		Состояние("Корректировка описаний иерархий...", , , БиблиотекаКартинок.ДлительнаяОперация48);
		ВыполнитьПерезаполнениеРегистра();
		Сообщить("Корректировка описаний иерархий окончена в " + ТекущаяДата());
		
	Иначе
		
		ПоказатьПредупреждение(, "Прервано пользователем!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерезаполнениеРегистра()
	
	ОбновлениеИнформационнойБазыИСС_ЗИП.СкорректироватьОписанияИерархийЭлементовСтруктурыЗаказов();
	
КонецПроцедуры
