Функция УдалитьДублиНаСервере(РучнойВызов) Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеИндексаППД);
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.УдалениеДублейИзТЧПоставщики;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияУдалениеДублейИзТЧПоставщики = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияУдалениеДублейИзТЧПоставщики.Количество() > 0 Тогда
		//Если РучнойВызов Тогда
			Структура = Новый Структура("ФоновоеЗаданиеУжеЗапущено, КоличествоОбработанныхЭлементов", Истина, 0);
			Возврат	Структура;
		//Иначе
		//	Возврат 0;
		//КонецЕсли;
	КонецЕсли;
	
	//Если РучнойВызов Тогда
		Возврат РегламентныеЗаданияПереопределяемый.УдалитьДублиИзТЧ();
	//Иначе
		//ФоновыеЗадания.Выполнить("РегламентныеЗаданияПереопределяемый.УдалитьДублиИзТЧ",,,"Удаление дублей в таблице поставщиков предметов снабжения");
	//КонецЕсли;
	
	 	//РегламентноеЗадание.
КонецФункции