// ++ 18.07.2018 11:47:54 Базунов Д.А. Задача: 
Процедура ПередУдалением(Отказ)
	
	НаборЗаписей = РегистрыСведений.ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Экземпляр.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.НаработкаЭкземляровКомплектующихИзделийКорабля.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Экземпляр.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.СвязанныеИзделияЭкземпляровКомплектующихИзделийКорабля.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Экземпляр.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
// -- 18.07.2018 11:47:54 Базунов Д.А. Задача:


