
Процедура ПередУдалением(Отказ)
		
	// Ремонт и модернизация
	
	НаборЗаписей = РегистрыСведений.РемонтИМодернизацияЗаказов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заказ.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
	
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ПроверитьУникальностьНаименования = Ложь;
	
	Если ЭтоНовый() Тогда
	
		ПроверитьУникальностьНаименования = Истина;	
	
	Иначе
		
		ПроверитьУникальностьНаименования = Не ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "Наименование") = Наименование;	
		
	КонецЕсли;
	
	Если ПроверитьУникальностьНаименования Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Заказы.Ссылка
		|ИЗ
		|	Справочник.Заказы КАК Заказы
		|ГДЕ
		|	Заказы.Наименование = &Наименование
		|	И НЕ Заказы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			Сообщить("Наименование корабля не уникально!");
			Возврат;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	//ПроверитьУникальностьЗаводскогоНомера = Ложь;
	//
	//Если ЭтоНовый() Тогда
	//
	//	ПроверитьУникальностьЗаводскогоНомера = Истина;	
	//
	//Иначе
	//	
	//	ПроверитьУникальностьЗаводскогоНомера = Не ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "ЗаводскойНомер") = ЗаводскойНомер;	
	//	
	//КонецЕсли;
	//
	//Если ПроверитьУникальностьЗаводскогоНомера Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	Заказы.Ссылка
	//	|ИЗ
	//	|	Справочник.Заказы КАК Заказы
	//	|ГДЕ
	//	|	Заказы.ЗаводскойНомер = &ЗаводскойНомер
	//	|	И НЕ Заказы.Ссылка = &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("ЗаводскойНомер", ЗаводскойНомер);
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если Не РезультатЗапроса.Пустой() Тогда
	//		
	//		Отказ = Истина;
	//		Сообщить("Заводской номер корабля не уникален!");
	//		Возврат;	
	//		
	//	КонецЕсли;	
	//	
	//КонецЕсли;
	
КонецПроцедуры

