/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция СформироватьТабличныйДокументПисьма()
	Возврат Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументПисьма(Объект.Предмет);
КонецФункции // СформироватьТабличныйДокументПисьма

&НаСервере
Функция СформироватьТабличныйДокументЛистСогласования()
	БизнесПроцессСогласования = БизнесПроцессы.СогласованиеРаспределенияЗаявкиФСВТС.ПолучитьБизнесПроцессСогласования(Объект.Предмет);
	Возврат Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументИсторииСогласования(БизнесПроцессСогласования);
КонецФункции // СформироватьТабличныйДокументПисьма

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаПоказатьВложения(Команда)
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", 	Объект.Предмет);	
	ПараметрыФормы.Вставить("ТолькоПросмотр", 	Истина);	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры // КомандаПоказатьВложения

&НаКлиенте
Процедура КомандаСформироватьПисьмо(Команда)
	ТабличныйДокументПисьма = СформироватьТабличныйДокументПисьма();
	ТабличныйДокументПисьма.Показать("Информационное письмо");
	ТабличныйДокументЛистСогласования = СформироватьТабличныйДокументЛистСогласования();
	ТабличныйДокументЛистСогласования.Показать("Лист согласования");
КонецПроцедуры // КомандаСформироватьПисьмо

/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсторияСогласования 						= Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументИсторииСогласования(Объект.БизнесПроцесс);
	ТабличныйДокумент							= Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументЗаявки(Объект.Предмет, Истина);
	Элементы.КомандаПоказатьВложения.Заголовок 	= Справочники.ЗаявкаФСВТСПрисоединенныеФайлы.ПолучитьКоличество(Объект.Предмет);	
КонецПроцедуры // ПриСозданииНаСервере


