
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияЦены();
	
КонецПроцедуры

Процедура СформироватьДвиженияЦены()

	Для каждого Строка Из Цены Цикл
	
		НоваяСтрока = Движения.ЦеныПредметовСнабжения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Период = Дата;
	
	КонецЦикла;
	
	Движения.ЦеныПредметовСнабжения.Записывать = Истина;	

КонецПроцедуры // СформироватьДвиженияЦены()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МСтрок = Цены.НайтиСтроки(Новый Структура("UID","                                    "));
	
	Для каждого Строка Из МСтрок Цикл
		
		Строка.UID = Новый УникальныйИдентификатор;
	
	КонецЦикла;
	
КонецПроцедуры
