#Область ЗагрузитьКлассификатор

Процедура СоздатьГруппуСпр(Строка)
	
	Найд = Справочники.ОКПД2.НайтиПоКоду(Строка.Код);
	Если Найд.Пустая() Тогда
		СпрГруппа = Справочники.ОКПД2.СоздатьГруппу();
	Иначе 
		СпрГруппа = Найд.ПолучитьОбъект();
	КонецЕсли;
	
	СпрГруппа.Код = Строка.Код;
	СпрГруппа.Наименование = Строка.Наименование;
	Перенос = НЕ(Строка.НеВключает = "");
	СпрГруппа.ОписаниеГруппировки = Строка.Включает + ?(Перенос, Символы.ПС, "") + Строка.НеВключает + ?(Перенос, Символы.ПС, "") + Строка.ДопИнформ;
	Если НЕ Строка.Родитель = Неопределено Тогда
		СпрГруппа.Родитель = Справочники.ОКПД2.НайтиПоКоду(Строка.Родитель.Код);
	КонецЕсли; 
	
	Попытка
		СпрГруппа.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьЭлементСпр(Строка)
	
	Найд = Справочники.ОКПД2.НайтиПоКоду(Строка.Код);
	Если Найд.Пустая() Тогда
		СпрЭлемент = Справочники.ОКПД2.СоздатьЭлемент();
	Иначе 
		СпрЭлемент = Найд.ПолучитьОбъект();
	КонецЕсли;
	
	СпрЭлемент.Код = Строка.Код;
	СпрЭлемент.Наименование = Строка.Наименование;
	СпрЭлемент.Родитель = Справочники.ОКПД2.НайтиПоКоду(Строка.Родитель.Код);
	Перенос = НЕ(Строка.НеВключает = "");
	СпрЭлемент.ОписаниеГруппировки = Строка.Включает + ?(Перенос, Символы.ПС, "") + Строка.НеВключает + ?(Перенос, Символы.ПС, "") + Строка.ДопИнформ;
	
	Попытка
		СпрЭлемент.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		Сообщить(Описание);
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьЭлементыСправочника(Дерево)
	
	Для каждого Строка Из Дерево.Строки Цикл
		
		Если Строка.Строки.Количество() > 0 Тогда
			СоздатьГруппуСпр(Строка);
		Иначе
			СоздатьЭлементСпр(Строка);
		КонецЕсли; 
		
		СоздатьЭлементыСправочника(Строка);
		
	КонецЦикла; 	
	
КонецПроцедуры
 

Процедура ЗаполнитьИзКлассификатора() Экспорт
	
	// Удаление
	//Выборка = Справочники.ОКПД2.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СпрОб = Выборка.ПолучитьОбъект();
	//	СпрОб.Удалить();
	//КонецЦикла; 
	
	ТаблДок = Справочники.ОКПД2.ПолучитьМакет("Классификатор");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Код");
	Дерево.Колонки.Добавить("Наименование");
	Дерево.Колонки.Добавить("Включает");
	Дерево.Колонки.Добавить("НеВключает");
	Дерево.Колонки.Добавить("ДопИнформ");
	
	Для сч = 2 По Всего Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя(); 	
		#КонецЕсли 
		
		КодОбъекта 	 = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		Наименование = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст);
		Включает 	 = СокрЛП(ТаблДок.Область(сч, 3, сч, 3).Текст);
		НеВключает 	 = СокрЛП(ТаблДок.Область(сч, 4, сч, 4).Текст);
		ДопИнформ 	 = СокрЛП(ТаблДок.Область(сч, 5, сч, 5).Текст);
		
		Раздел		 = СокрЛП(ТаблДок.Область(сч, 6, сч, 6).Текст); // Буква
		Класс		 = СокрЛП(ТаблДок.Область(сч, 7, сч, 7).Текст);
		Подкласс	 = СокрЛП(ТаблДок.Область(сч, 8, сч, 8).Текст);
		Группа		 = СокрЛП(ТаблДок.Область(сч, 9, сч, 9).Текст);
		Подгруппа	 = СокрЛП(ТаблДок.Область(сч, 10, сч, 10).Текст);
		Вид			 = СокрЛП(ТаблДок.Область(сч, 11, сч, 11).Текст);
		Категория	 = СокрЛП(ТаблДок.Область(сч, 12, сч, 12).Текст);
		Подкатегория = СокрЛП(ТаблДок.Область(сч, 13, сч, 13).Текст);
		
		Если КодОбъекта = "" Тогда
			Прервать;
		КонецЕсли; 
		
		// Раздел	Класс	Подкласс	Группа	Подгруппа	Вид
		// 	  A		 01			1		  1		    1		 9        // A 01.11.19
		ДеревоУровень = Неопределено;
		Если НЕ Раздел = "" Тогда
			Найд = Дерево.Строки.Найти(Раздел,"Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = Дерево.Строки.Добавить();
				НовСтр.Код = КодОбъекта;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли; 
		КонецЕсли; 
		Если НЕ Класс = "" Тогда
			Найд = Дерево.Строки.Найти(Класс,"Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Раздел, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		Если НЕ Подкласс = "" Тогда
			Найд = Дерево.Строки.Найти(Класс+"."+Подкласс, "Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс+"."+Подкласс;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Класс, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		Если НЕ Группа = "" Тогда
			Найд = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа, "Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс+"."+Подкласс+Группа;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Класс+"."+Подкласс, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		Если НЕ Подгруппа = "" Тогда
			Найд = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа, "Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс+"."+Подкласс+Группа+"."+Подгруппа;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		Если НЕ Вид = "" Тогда
			Найд = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа+Вид, "Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс+"."+Подкласс+Группа+"."+Подгруппа+Вид;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		Если НЕ Категория = "" Тогда
			Найд = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа+Вид+"."+Категория, "Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс+"."+Подкласс+Группа+"."+Подгруппа+Вид+"."+Категория;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		Если НЕ Подкатегория = "" Тогда
			КодКатегории = Строка(Число(Категория) + Число(Подкатегория));
			Найд = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа+Вид+"."+КодКатегории, "Код", Истина);
			Если Найд = Неопределено Тогда
				НовСтр = ДеревоУровень.Строки.Добавить();
				НовСтр.Код = Класс+"."+Подкласс+Группа+"."+Подгруппа+Вид+"."+КодКатегории;
				НовСтр.Наименование = Наименование;
				НовСтр.Включает   = Включает;
				НовСтр.НеВключает = НеВключает;
				НовСтр.ДопИнформ  = ДопИнформ;
				//НовСтр.Родитель = Дерево.Строки.Найти(Класс+"."+Подкласс+Группа+"."+Подгруппа, "Код", Истина);
			Иначе
				ДеревоУровень = Найд;
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла;
	
	СоздатьЭлементыСправочника(Дерево);
	
КонецПроцедуры
 
#КонецОбласти 