
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
	
		ПроверитьУникальностьНомера = Истина;	
	
	Иначе
		
		ПроверитьУникальностьНомера = Не ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Ссылка, "Номер") = Номер;	
		
	КонецЕсли;
	
	Если ПроверитьУникальностьНомера Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Помещения.Ссылка
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	НЕ Помещения.Ссылка = &Ссылка
		|	И Помещения.Номер = &Номер";
		
		Запрос.УстановитьПараметр("Номер", Номер);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			Сообщить("Номер помещения не уникален!");
			Возврат;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры
