
&НаКлиенте
Процедура ВывестиТекущееСостояние(ТекстСообщения,ДатаНачала=Неопределено,КоличествоЗавершено=0,ОбщееКоличество=0,СтрПрошло="",СтрОсталось="",СтрокаПояснение="") Экспорт
	
	ОбработкаПрерыванияПользователя();
	
	Если ДатаНачала = Неопределено Тогда
		ДатаНачала = ТекущаяДата();
	КонецЕсли; 
	
	ТекДата = ТекущаяДата();
	ВремяОсталось = Дата(1,1,1) + ?(КоличествоЗавершено=0,0,(ТекДата - ДатаНачала)/КоличествоЗавершено*(ОбщееКоличество-КоличествоЗавершено));
	ВремяПрошло   = Дата(1,1,1) + (ТекДата-ДатаНачала);
	СтрОсталось = ?(ВремяОсталось = Дата(1,1,1),"00:00:00",?(Год(ВремяОсталось)>1,Строка(Год(ВремяОсталось)-1) + " г. ","") + ?(Месяц(ВремяОсталось)>1,Строка(Месяц(ВремяОсталось)-1) + " мес. ","") + ?(День(ВремяОсталось)>1,Строка(День(ВремяОсталось)-1) + " дн. ","") + Формат(ВремяОсталось,"ДФ=""ЧЧ:мм:сс"""));
	СтрПрошло 	= ?(ВремяПрошло   = Дата(1,1,1),"00:00:00",?(Год(ВремяПрошло)>1,Строка(Год(ВремяПрошло)-1) + " г. ","") + ?(Месяц(ВремяПрошло)>1,Строка(Месяц(ВремяПрошло)-1) + " мес. ","") + ?(День(ВремяПрошло)>1,Строка(День(ВремяПрошло)-1) + " дн. ","") + Формат(ВремяПрошло,"ДФ=""ЧЧ:мм:сс"""));
	СтрокаПояснение = "Прошло: " + СтрПрошло + "  Осталось: " + СтрОсталось;
	
	Состояние("" + ДатаНачала  + " (" + КоличествоЗавершено + "/" + ОбщееКоличество + "): " + ТекстСообщения 
	,?(ОбщееКоличество=0,100,Цел(100/ОбщееКоличество*КоличествоЗавершено))
	,СтрокаПояснение);
		
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		КаталогВыгрузки = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
	+ "(*.xlsx)|*.xlsx|(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ФайлЗагрузкиНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));	
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ФайлЗагрузки = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВернутьЗначениеРеквизитаПоставщика(ИмяРеквизита="")
	
	Возврат ТекПоставщик[ИмяРеквизита];
	
КонецФункции

&НаСервере
Функция ВернутьКонтакнуюИнформацию(Вид = "")
	
	Если Вид = "ПочтовыйАдрес" Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекПоставщик, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдрес);
	ИначеЕсли Вид = "ЭлектроннаяПочта" Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекПоставщик, Справочники.ВидыКонтактнойИнформации.ЭлектроннаяПочта);
	ИначеЕсли Вид = "Факс" Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекПоставщик, Справочники.ВидыКонтактнойИнформации.Факс);
	Иначе 
		Возврат ""
	КонецЕсли; 
	
КонецФункции
 
&НаКлиенте
Процедура ЗаполнитьПараметрыЗамены()
	
	//ТекПоставщик;
	ТаблЗамены.Очистить();
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "< название организации>";
	НовСтр.НаЧтоЗаменить = ВернутьЗначениеРеквизитаПоставщика("Наименование");
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "<должность руководителя организации>";
	ДолжностьРуководителя = ВернутьЗначениеРеквизитаПоставщика("ДолжностьРуководителяДательный");
	НовСтр.НаЧтоЗаменить = ?(ДолжностьРуководителя = "", "Генеральному директору ", ДолжностьРуководителя);
	
	//НовСтр = ТаблЗамены.Добавить();
	//НовСтр.ЧтоЗаменить = "<Должность руководителя и название организации>";
	//НовСтр.НаЧтоЗаменить = ВернутьЗначениеРеквизитаПоставщика("ДолжностьРуководителяДательный") + Символы.ПС + ВернутьЗначениеРеквизитаПоставщика("Название"); // "БазуновДА";
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "<Фамилия и инициалы руководителя>";
	НовСтр.НаЧтоЗаменить = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВернутьЗначениеРеквизитаПоставщика("ФИОРуководителяДательный"));
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "<Почтовый адрес организации>";
	НовСтр.НаЧтоЗаменить = ВернутьКонтакнуюИнформацию("ПочтовыйАдрес");
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "<Номер факса>";
	НовСтр.НаЧтоЗаменить = ВернутьКонтакнуюИнформацию("Факс");
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "<Имя и отчество руководителя>";
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВернутьЗначениеРеквизитаПоставщика("ФИОРуководителя"));
	НовСтр.НаЧтоЗаменить = ?(НЕ СтруктураФИО.Имя = Неопределено, СтруктураФИО.Имя, "") + " " + ?(НЕ СтруктураФИО.Отчество = Неопределено, СтруктураФИО.Отчество, "");
	
	НовСтр = ТаблЗамены.Добавить();
	НовСтр.ЧтоЗаменить = "<электронный адрес>.";
	НовСтр.НаЧтоЗаменить = ВернутьКонтакнуюИнформацию("ЭлектроннаяПочта");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьИЗаписатьШаблонWord(ИмяФайла)
	
	ЗаполнитьПараметрыЗамены();
	
	ПараметрыПисьма = Новый Соответствие;
	Для каждого Замена Из ТаблЗамены Цикл
		Ключ = СтрЗаменить(СтрЗаменить(Замена.ЧтоЗаменить, "<",""), ">","");
		ПараметрыПисьма.Вставить(Ключ, Замена.НаЧтоЗаменить);
	КонецЦикла;  // Для каждого Замена Из ТаблЗамены Цикл
	ЭлектронныйАдрес = ПараметрыПисьма.Получить("электронный адрес.");
	Если Не ЭлектронныйАдрес = Неопределено Тогда
		ПараметрыПисьма.Удалить("электронный адрес.");	
		ПараметрыПисьма.Вставить("ЭлектронныйАдрес", ЭлектронныйАдрес);
	КонецЕсли; // Если Не ЭлектронныйАдрес = Неопределено Тогда
	
	АдресХранилища = РаботаСФайламиOffice.ПодговитьПисьмоВыгрузкаПСДляПоставщиков(ПараметрыПисьма);
	
	ДанныеКЗаписи = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ДанныеКЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ДанныеКЗаписи = Неопределено Тогда
	
	Попытка
		ДанныеКЗаписи.ЗаписатьАсинх(ИмяФайла);
	Исключение
		Сообщить("Не удалось записать файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИЗаписатьШаблонExcel(ИмяФайла, ДанныеСтрок)
	
	ДанныеПС = Новый Массив;
	Для Каждого ОписаниеЭлемента Из ДанныеСтрок Цикл
		ОписаниеСтроки = Новый Структура;
		ОписаниеСтроки.Вставить("Идентификатор",	ОписаниеЭлемента.Идентификатор);
		ОписаниеСтроки.Вставить("ПредметСнабжения", ОписаниеЭлемента.ПредметСнабжения);
		ОписаниеСтроки.Вставить("Входимость", 		ОписаниеЭлемента.Входимость);
		ДанныеПС.Добавить(ОписаниеСтроки);
	КонецЦикла; // Для Каждого ОписаниеЭлемента Из ДанныеСтрок Цикл
	
	ДокументыКЗаписи = РаботаСФайламиOffice.ПодготовитьТабличныеДокументыДанныеПСДляПоставщиков(ДанныеПС);
	Если ДокументыКЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ДокументыКЗаписи = Неопределено Тогда
	
	РаботаСФайламиOfficeКлиент.ЗаписатьЛистыВОдинДокумент(ИмяФайла, ДокументыКЗаписи);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеСтрокиДереве()
	
	Результат = Новый Структура;
	
	ДеревоПредметовСнабжения = РеквизитФормыВЗначение("ДеревоПС");
	Для Каждого Колонка Из  ДеревоПредметовСнабжения.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла; // Для Каждого Колонка Из  ДеревоПредметовСнабжения.Колонки Цикл
	
КонецФункции // ПолучитьОписаниеСтрокиДереве


&НаСервере
Процедура ЗаписатьВыгруженныеЭлементыВРегистр()
	
	Дерево = ДанныеФормыВЗначение(ДеревоПС, Тип("ДеревоЗначений"));
	
	ДатаВыгрузки = ТекущаяДата();
	Статус		 = Перечисления.СтатусыВыгрузкиПредметовСнабжения.Отправлено;
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Поставщик = СтрокаДерева.СсылкаПоставщик;
		
		Набор = РегистрыСведений.ВыгруженныеПредметыСнабжения.СоздатьНаборЗаписей();
		Набор.Отбор.Поставщик.Установить(Поставщик);
		Набор.Прочитать();
		Набор.Очистить();
		
		Для каждого Строка Из СтрокаДерева.Строки Цикл
			
			НовСтр = Набор.Добавить();
			НовСтр.Поставщик = Поставщик;
			НовСтр.ПредметСнабжения = Строка.СсылкаПС;
			НовСтр.ДатаВыгрузки = ДатаВыгрузки;
			НовСтр.Статус = Статус;
			
		КонецЦикла; 
		
		Набор.Записать(Истина);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(Имя="")
	
	Если Имя = "" Тогда
		Имя = "Макет";
	КонецЕсли; 
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОтчетОбъект.ПолучитьМакет(Имя);
	
	Возврат Макет;
	
КонецФункции

&НаСервере
Функция СформироватьДеревоДляВыгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблПоставщиков
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&Контрагент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КаталогПСИзготовителиИПоставщики.Контрагент КАК Поставщик,
	|	КаталогПС.Ссылка КАК Ссылка,
	|	КаталогПС.Наименование КАК НаименованиеПС,
	|	КаталогПС.Обозначение КАК ОбозначениеПС,
	|	КаталогПС.ДокументНаПоставку КАК ДокументНаПоставкуПС,
	|	МАКСИМУМ(СтруктураЗаказа.Родитель.ПредметСнабжения) КАК Входимость
	|ПОМЕСТИТЬ ТаблицаПС
	|ИЗ
	|	Справочник.КаталогПредметовСнабжения КАК КаталогПС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения.ИзготовителиИПоставщики КАК КаталогПСИзготовителиИПоставщики
	|		ПО (КаталогПСИзготовителиИПоставщики.Ссылка = КаталогПС.Ссылка)
	|			И (КаталогПСИзготовителиИПоставщики.Поставщик)
	|			И (КаталогПСИзготовителиИПоставщики.Контрагент В (&Контрагент))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказа
	|		ПО (СтруктураЗаказа.ПредметСнабжения = КаталогПС.Ссылка)
	|			И (НЕ СтруктураЗаказа.Тип = ЗНАЧЕНИЕ(Справочник.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля.Группа))
	|ГДЕ
	|	СтруктураЗаказа.Владелец.Владелец В(&Проекты)
	|	И НЕ КаталогПС.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	КаталогПСИзготовителиИПоставщики.Контрагент,
	|	КаталогПС.Ссылка,
	|	КаталогПС.Наименование + "", "" + КаталогПС.Обозначение + "", "" + КаталогПС.ДокументНаПоставку,
	|	КаталогПС.Наименование,
	|	КаталогПС.Обозначение,
	|	КаталогПС.ДокументНаПоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблПоставщиков.Ссылка.Наименование КАК Поставщик,
	|	ТаблПоставщиков.Ссылка КАК СсылкаПоставщик,
	|	ЕСТЬNULL(ТаблицаПС.Ссылка, ЗНАЧЕНИЕ(Справочник.КаталогПредметовСнабжения.ПустаяСсылка)) КАК СсылкаПС,
	|	ЕСТЬNULL(ТаблицаПС.НаименованиеПС, """") КАК НаименованиеПС,
	|	ЕСТЬNULL(ТаблицаПС.ОбозначениеПС, """") КАК ОбозначениеПС,
	|	ЕСТЬNULL(ТаблицаПС.ДокументНаПоставкуПС, """") КАК ДокументНаПоставкуПС,
	|	ЕСТЬNULL(ТаблицаПС.Входимость.Наименование, """") КАК Наименование,
	|	ЕСТЬNULL(ТаблицаПС.Входимость.Обозначение, """") КАК Обозначение,
	|	ЕСТЬNULL(ТаблицаПС.Входимость.ДокументНаПоставку, """") КАК ДокументНаПоставку
	|ИЗ
	|	ТаблПоставщиков КАК ТаблПоставщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПС КАК ТаблицаПС
	|		ПО ТаблПоставщиков.Ссылка = ТаблицаПС.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	НаименованиеПС
	|ИТОГИ
	|	МИНИМУМ(СсылкаПоставщик)
	|ПО
	|	Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПС";
	
	Проекты = Новый Массив;
	Проекты.Добавить(Справочники.ПроектыКораблей.НайтиПоНаименованию("877ЭКМ"));
	Проекты.Добавить(Справочники.ПроектыКораблей.НайтиПоНаименованию("11356"));
	Запрос.УстановитьПараметр("Проекты", Проекты);
	МассПоставщиков = Новый Массив;
	Для каждого Пост Из Поставщики Цикл
		Если Пост.Пометка Тогда
			МассПоставщиков.Добавить(Пост.Значение);
		КонецЕсли; 
	КонецЦикла; 
	Запрос.УстановитьПараметр("Контрагент", МассПоставщиков);
	
	Дерево = ДанныеФормыВЗначение(ДеревоПС, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаПоставщик = Дерево.Строки.Добавить();
		СтрокаПоставщик.Поставщик = Выборка.Поставщик;
		СтрокаПоставщик.СсылкаПоставщик = Выборка.СсылкаПоставщик;
		
		ВыборкаПС = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПС.Следующий() Цикл
			Если ВыборкаПС.СсылкаПС.Пустая() Тогда
				Продолжить;
			КонецЕсли; 
			НовСтр = СтрокаПоставщик.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаПС);
			НовСтр.ПредметСнабжения = ВыборкаПС.НаименованиеПС + ?(ВыборкаПС.ОбозначениеПС = "", "", ", " +ВыборкаПС.ОбозначениеПС) + ?(ВыборкаПС.ДокументНаПоставкуПС = "", "", ", " +ВыборкаПС.ДокументНаПоставкуПС);
			НовСтр.Входимость = ВыборкаПС.Наименование + ?(ВыборкаПС.Обозначение = "", "", ", " +ВыборкаПС.Обозначение) + ?(ВыборкаПС.ДокументНаПоставку = "", "", ", " +ВыборкаПС.ДокументНаПоставку);
			НовСтр.Идентификатор = ВыборкаПС.СсылкаПС.УникальныйИдентификатор();
		КонецЦикла; 
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Дерево, ДеревоПС);

КонецФункции

&НаКлиенте
Процедура ЗаписатьФайлPDF(ИмяФайла)
	
	//Получаем макет из двоичных данных
	МакетPDF = ПолучитьМакетНаСервере("МакетPDF");
	
	МакетPDF.ЗаписатьАсинх(ИмяФайла);
	
КонецПроцедуры
 
&НаКлиенте
Асинх Процедура Выгрузить(Команда)
	
	Если КаталогВыгрузки = "" Тогда
		Сообщить("Не указан каталог выгрузки");
		Возврат;
	КонецЕсли; 
	
	СформироватьДеревоДляВыгрузки();
	
	Выборка = ДеревоПС.ПолучитьЭлементы(); 	ВремяНачалаОбработки = ТекущаяДата(); 
	
	ОбщееКоличество = Выборка.Количество();
	Порция = МАКС(Цел(ОбщееКоличество/100), 1); ТекСчетчик = 0;
	
	Если ОбщееКоличество = 0 Тогда
		Сообщить("Нет данных для выгрузки")
	КонецЕсли; 
	
	Для каждого СтрокаДерева Из Выборка Цикл
		
		Поставщик = СокрЛП(СтрокаДерева.Поставщик); ТекСчетчик = ТекСчетчик + Порция;
		ТекПоставщик = СтрокаДерева.СсылкаПоставщик;
		
		Если СтрокаДерева.ПолучитьЭлементы().Количество() = 0 Тогда
			Сообщить("По "+Строка(Поставщик)+" нет данных для выгрузки");
			Продолжить;
		КонецЕсли; 
		
		// Состояние
		//ВывестиТекущееСостояние("Выгрузка: "+Поставщик, ВремяНачалаОбработки, ТекСчетчик, ОбщееКоличество);
		
		// Путь для выгрузки
		Путь = КаталогВыгрузки+"\"+СтрЗаменить(Поставщик, """", "");
		
		// СОздаем каталог с именем поставщика
		Ждать СоздатьКаталогАсинх(Путь);
		
		// Имя файла эксель		
		ИмяФайла = Путь + "\"+ВернутьЗначениеРеквизитаПоставщика("Код")+".xlsx";
		// Записываем файл в эксель
		ЗаполнитьИЗаписатьШаблонExcel(ИмяФайла, СтрокаДерева.ПолучитьЭлементы());
		
		// Имя файла word
		ИмяФайла = Путь + "\"+ВернутьЗначениеРеквизитаПоставщика("Код")+".docx";
		// Записываем файл в word
		ЗаполнитьИЗаписатьШаблонWord(ИмяФайла);
		
		// Имя файла pdf
		ИмяФайлаPDF = Путь + "\23-12776.pdf";
		// Записываем файл pdf
		ЗаписатьФайлPDF(ИмяФайлаPDF);
		
		ОбработкаПрерыванияПользователя();
		
	КонецЦикла;
	
	ЗаписатьВыгруженныеЭлементыВРегистр();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВыгруженныеНаСервере()
	
	Набор = РегистрыСведений.ВыгруженныеПредметыСнабжения.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВыгруженные(Команда)
	ОчиститьВыгруженныеНаСервере();
КонецПроцедуры

// ++ Загрузка
&НаСервере
Функция ВернутьТаблицуДляЦен()
	
	ТЗ_Цен = Новый ТаблицаЗначений;
	ТЗ_Цен.Колонки.Добавить("ПредметСнабжения");
	ТЗ_Цен.Колонки.Добавить("ТипЦены");
	ТЗ_Цен.Колонки.Добавить("Контрагент");
	ТЗ_Цен.Колонки.Добавить("Цена");
	ТЗ_Цен.Колонки.Добавить("Количество");
	ТЗ_Цен.Колонки.Добавить("Валюта");
	ТЗ_Цен.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗ_Цен.Колонки.Добавить("Статус");
	ТЗ_Цен.Колонки.Добавить("ДатаЦены");
	ТЗ_Цен.Колонки.Добавить("Примечание");
	
	Возврат ТЗ_Цен;
	
КонецФункции

&НаСервере
Функция СоздатьВводЦен(ТЗ, НаДату="", Комментарий="")
	
	НовДок = Документы.ВводНачальныхОстатковЦен.СоздатьДокумент();
	НовДок.Дата = ?(НаДату = "", ТекущаяДата(), НаДату);
	Если Не ЗначениеЗаполнено(НовДок.Дата) Тогда
		НовДок.Дата = ТекущаяДатаСеанса();
	КонецЕсли; // Если Не ЗначениеЗаполнено(НовДок.Дата) Тогда
	НовДок.Комментарий = Комментарий;
	
	НовДок.Цены.Загрузить(ТЗ);
	
	НовДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	СпрПС = Справочники.КаталогПредметовСнабжения;
	СтатусЗагружено = Перечисления.СтатусыВыгрузкиПредметовСнабжения.Загружено;
	
	ТЗ_Цен = ВернутьТаблицуДляЦен();
	
	Рубль = Справочники.ОКВ.НайтиПоКоду("643");
	
	Набор = РегистрыСведений.ВыгруженныеПредметыСнабжения.СоздатьНаборЗаписей();
	Набор.Отбор.Поставщик.Установить(ТекПоставщик);
	Набор.Прочитать();
	
	ТаблицаНабора = Набор.Выгрузить();
	
	Для каждого Строка Из ТаблицаЗагрузки Цикл
		
		СсылкаНайденныйПС = СпрПС.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.Идентификатор));
		
		Попытка
			Пустая = СсылкаНайденныйПС.ПолучитьОбъект();
		Исключение
		    Пустая = Неопределено;
		КонецПопытки;
		
		НадоЗаписать = Ложь;
		Если НЕ Пустая = Неопределено Тогда
			
			Стру = Новый Структура;
			Если НЕ Строка.Наименование = "" И НЕ СсылкаНайденныйПС.Наименование = Строка.Наименование Тогда
				Стру.Вставить("Наименование", Строка.Наименование);
				НадоЗаписать = Истина;
			КонецЕсли; 
			Если НЕ Строка.Обозначение = "" И НЕ СсылкаНайденныйПС.Обозначение = Строка.Обозначение Тогда
				Стру.Вставить("Обозначение", Строка.Обозначение);
				НадоЗаписать = Истина;
			КонецЕсли; 
			Если НЕ Строка.ДокументНаПоставку = "" И НЕ СсылкаНайденныйПС.ДокументНаПоставку = Строка.ДокументНаПоставку Тогда
				Стру.Вставить("ДокументНаПоставку", Строка.ДокументНаПоставку);
				НадоЗаписать = Истина;
			КонецЕсли;
			Если НЕ Строка.ИнформацияОПравилах = "" И НЕ СсылкаНайденныйПС.ПравилаУпаковкиТранспортировкиХранения = Строка.ИнформацияОПравилах Тогда
				Стру.Вставить("ПравилаУпаковкиТранспортировкиХранения", Строка.ИнформацияОПравилах);
				НадоЗаписать = Истина;
			КонецЕсли;
			
		Иначе
			
			Сообщить("Не нашли ПС!!!");
			Продолжить;
			
		КонецЕсли;
		
		Если НадоЗаписать Тогда
			СпрОб = СсылкаНайденныйПС.ПолучитьОбъект();
			Для каждого Элем Из Стру Цикл
				СпрОб[Элем.Ключ] = Элем.Значение;
			КонецЦикла;
			Попытка
				//ЗаписатьВЛог(Строка.Идентификатор, СпрОб.Ссылка, "", "Обновили ПС: " + Строка(СпрОб.Ссылка));
				СпрОб.Записать();
			Исключение
			    аа = ОписаниеОшибки();
				Сообщить(аа);
				Прервать;
			КонецПопытки;
			
			Найд = ТаблицаНабора.Найти(СпрОб.Ссылка, "ПредметСнабжения");
			
			Если НЕ Найд = Неопределено Тогда
				Найд.Статус = СтатусЗагружено;
			КонецЕсли; 
			ЭлемПС = СпрОб.Ссылка;	
		Иначе
			ЭлемПС = СсылкаНайденныйПС;	
		КонецЕсли; 
		
		Если ТЗ_Цен.Найти(ЭлемПС, "ПредметСнабжения") = Неопределено Тогда
			НовСтр = ТЗ_Цен.Добавить();
			НовСтр.ПредметСнабжения = ЭлемПС;
			НовСтр.ТипЦены = Перечисления.ТипыЦен.Внутренняя; 
			НовСтр.Контрагент = ТекПоставщик;
			НовСтр.Цена = Строка.Цена;
			НовСтр.Количество = 0;
			НовСтр.Валюта = Рубль;
			НовСтр.ЕдиницаИзмерения = "";
			НовСтр.ДатаЦены = Строка.ДатаЦены;
		КонецЕсли;
		
	КонецЦикла; 
	
	Набор.Загрузить(ТаблицаНабора);
	Набор.Записать(Истина);
	
	ТЗ_Годов = ТЗ_Цен.Скопировать();
	ТЗ_Годов.Свернуть("ДатаЦены");
	
	Для каждого Стр Из ТЗ_Годов Цикл
		НовТЗ = ТЗ_Цен.Скопировать(ТЗ_Цен.НайтиСтроки(Новый Структура("ДатаЦены", Стр.ДатаЦены)));
		СоздатьВводЦен(НовТЗ, Стр.ДатаЦены, "Цены от "+Строка(ТекПоставщик));
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ПараметрыФайла = РаботаСФайламиOfficeКлиент.ПодготовитьФайлКЧтению(ФайлЗагрузки, "ТабличныйДокумент");
	Если ПараметрыФайла = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ПараметрыФайла = Неопределено Тогда
	
	ТабличныйДокумент = РаботаСФайламиOffice.ПрочитатьФайлВТабличныйДокумент(ПараметрыФайла.Адрес, ПараметрыФайла);
	Если ТабличныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ТабличныйДокумент = Неопределено Тогда
	
	НачалоСтроки = 3;
	
	// Лист оборудование
	ЛистЭксель = ТабличныйДокумент; 
	
	ВсегоСтрок = ТабличныйДокумент.ВысотаТаблицы; 
	
	Для сч = НачалоСтроки По ВсегоСтрок Цикл // Самую первую пропускаем
		
		Стр1 = СокрЛП(ЛистЭксель.Область(сч, 1).Текст);
		Стр2 = СокрЛП(ЛистЭксель.Область(сч, 2).Текст);
		Стр3 = СокрЛП(ЛистЭксель.Область(сч, 3).Текст);
		Стр4 = СокрЛП(ЛистЭксель.Область(сч, 4).Текст);
		Стр5 = СокрЛП(ЛистЭксель.Область(сч, 5).Текст);
		Стр6 = СокрЛП(ЛистЭксель.Область(сч, 6).Текст);
		Стр7 = СокрЛП(ЛистЭксель.Область(сч, 7).Текст);
		Стр8 = СокрЛП(ЛистЭксель.Область(сч, 8).Текст);
		Стр9 = СокрЛП(ЛистЭксель.Область(сч, 9).Текст);
		Стр10 = ЛистЭксель.Область(сч, 10).Текст;
		Стр11 = СокрЛП(ЛистЭксель.Область(сч, 11).Текст);
		
		НовСтр = ТаблицаЗагрузки.Добавить();
		НовСтр.Идентификатор       = Стр1;
		НовСтр.Наименование        = Стр4;
		НовСтр.Обозначение         = Стр5;
		НовСтр.ДокументНаПоставку  = Стр6;
		НовСтр.Цена                = Стр9;
		Если ТипЗнч(Стр10) = Тип("Дата") Тогда
			НовСтр.ДатаЦены		   = Стр10;
		ИначеЕсли ЗначениеЗаполнено(Стр10) Тогда
			МассДаты = СтрРазделить(СтрЗаменить(Стр10, " 00:00:00", ""), ".");
			НовСтр.ДатаЦены		   = Дата(МассДаты[2], МассДаты[1], МассДаты[0]);
		КонецЕсли; 
		НовСтр.ИнформацияОПравилах = Стр11;
		
	КонецЦикла;
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекПоставщик = "";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОСКНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПризнакОСК
	|	И НЕ Организации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Поставщики.ЗагрузитьЗначения(Выборка.ВыгрузитьКолонку("Ссылка"));
	Поставщики.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОСК(Команда)
	ЗаполнитьОСКНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьПометки(Флаг)
	Поставщики.ЗаполнитьПометки(Флаг);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	УстановитьСнятьПометки(Ложь)
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	УстановитьСнятьПометки(Истина)
КонецПроцедуры
