
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Экземпляр = Неопределено;
	
	Если Параметры.Свойство("Экземпляр", Экземпляр) Тогда
		
		Запись.Экземпляр = Экземпляр;
		
	КонецЕсли;
	
	Корабль = Запись.Экземпляр.Корабль;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанноеИзделиеПриИзменении(Элемент)
	
	Если Запись.СвязанноеИзделие = Запись.Экземпляр Тогда
		
		Сообщить("Нельзя связать изделие с самим собой!");
		Запись.СвязанноеИзделие = ЭкземплярПустаяСсылка;
		
	КонецЕсли;
	
КонецПроцедуры
