
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

  СтандартнаяОбработка = Ложь;

  Представление = Строка(Данные.Тип)+ " №"+Данные.НомерКонтракта+" от "+Формат(Данные.Дата, "ДФ=dd.MM.yy");

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

  СтандартнаяОбработка = Ложь;

  Поля.Добавить("Дата");
  Поля.Добавить("НомерКонтракта");
  Поля.Добавить("Тип");

КонецПроцедуры

//++ 11.04.2018 Веденеев П. //разделение формы документа
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = ?(Параметры.Ключ.Вид = Перечисления.ВидыКонтрактов.КонтрактСПоставщиком, "ФормаКонтрактаСПоставщиком", "ФормаКонтрактаСЗаказчиком");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//-- 11.04.2018 Веденеев П. //разделение формы документа
