//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИ

&НаСервере
Процедура ПолучитьПочту()
	ОбменССайтом.ПолучитьПочту();
КонецПроцедуры // ПолучитьПочту

&НаСервере
Процедура ОбработатьПочтовыеСообщения()
	ОбменССайтом.ОбработатьПочтовыеСообщения();
КонецПроцедуры // ОбработатьПочтовыеСообщения

//////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаПолучитьПочту(Команда)
	ПолучитьПочту();
	Элементы.Список.Обновить();
КонецПроцедуры // КомандаПолучитьПочту

&НаКлиенте
Процедура КомандаОбработатьПочтовыеСообщения(Команда)
	ОбработатьПочтовыеСообщения();
КонецПроцедуры // КомандаОбработатьПочтовыеСообщения
