Процедура ЗаполнитьИзКлассификатора() Экспорт
	
	// Удаление
	//Выборка = Справочники.ОКАТО.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СпрОб = Выборка.ПолучитьОбъект();
	//	СпрОб.Удалить();
	//КонецЦикла; 
	
	ТаблДок = Справочники.ОКАТО.ПолучитьМакет("КлассификаторОКАТО");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	СпрОКАТО = Справочники.ОКАТО;
	
	Для сч = 2 По Всего Цикл
		
		НазваниеОбъекта = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		
		Если НазваниеОбъекта = "" Тогда
			Прервать;
		КонецЕсли; 
		
		КодОбъекта = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст);
		Родитель   = СокрЛП(ТаблДок.Область(сч, 3, сч, 3).Текст);
		Количество = СокрЛП(ТаблДок.Область(сч, 4, сч, 4).Текст);
		АдмЦентр   = СокрЛП(ТаблДок.Область(сч, 5, сч, 5).Текст);
		
		Если Количество = "0" Тогда
			СоздаемЭлемент = Истина;
		Иначе
			СоздаемЭлемент = Ложь;
		КонецЕсли; 
		
		Если СоздаемЭлемент Тогда
			
			Найд = СпрОКАТО.НайтиПоКоду(КодОбъекта);
			Если Найд.Пустая() Тогда
				СпрЭлемент = СпрОКАТО.СоздатьЭлемент();
			Иначе 
				СпрЭлемент = Найд.ПолучитьОбъект();
			КонецЕсли; 
			СпрЭлемент.Код = КодОбъекта;
			СпрЭлемент.Наименование = НазваниеОбъекта;
			СпрЭлемент.Родитель = СпрОКАТО.НайтиПоКоду(Родитель);
			СпрЭлемент.ДополнительныеДанные = АдмЦентр;
			Попытка
				СпрЭлемент.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
		Иначе
			
			Найд = СпрОКАТО.НайтиПоКоду(КодОбъекта);
			Если Найд.Пустая() Тогда
				СпрГруппа = СпрОКАТО.СоздатьГруппу();
			Иначе 
				СпрГруппа = Найд.ПолучитьОбъект();
			КонецЕсли;
			СпрГруппа.Код = КодОбъекта;
			СпрГруппа.Родитель = СпрОКАТО.НайтиПоКоду(Родитель);
			СпрГруппа.Наименование = НазваниеОбъекта;
			СпрГруппа.ДополнительныеДанные = АдмЦентр;
			Попытка
				СпрГруппа.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли; 
				
	КонецЦикла; 
	
		
КонецПроцедуры
 