
//////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьЗначенияРеквизитов(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенПредметовСнабжения.Дата КАК Период,
	|	УстановкаЦенПредметовСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	УстановкаЦенПредметовСнабжения.ТипЦены КАК ТипЦены,
	|	УстановкаЦенПредметовСнабжения.Контрагент КАК Контрагент,
	|	УстановкаЦенПредметовСнабжения.Цена КАК Цена,
	|	УстановкаЦенПредметовСнабжения.Количество КАК Количество,
	|	УстановкаЦенПредметовСнабжения.Валюта КАК Валюта,
	|	УстановкаЦенПредметовСнабжения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УстановкаЦенПредметовСнабжения.УсловиеПоставки КАК УсловиеПоставки,
	|	УстановкаЦенПредметовСнабжения.UID КАК UID
	|ИЗ
	|	Документ.УстановкаЦенПредметовСнабжения КАК УстановкаЦенПредметовСнабжения
	|ГДЕ
	|	УстановкаЦенПредметовСнабжения.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьЗначенияРеквизитов()
 