
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Владелец") Тогда
		
		Отказ = Истина;
		
	Иначе
		
		Список.Параметры.УстановитьЗначениеПараметра("Язык", 
			ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Параметры.Отбор.Владелец, "Заказчик"), "ЯзыкПредставленияДанных"));
		
		Если Параметры.Свойство("ОтображатьКакСписок") Тогда
			
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			
		КонецЕсли;
		
		Если Параметры.Свойство("Система", Система) Тогда
			
			ОтборСистема = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборСистема.Использование = Истина;
			ОтборСистема.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ОтборСистема.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			ОтборСистема.ПравоеЗначение = Система;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
