
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого СтруктураКолонки Из Параметры.МассивКолонок Цикл
	
		НоваяСтрока = КолонкиСпецификации.Добавить();
		НоваяСтрока.Включить = Истина;
		НоваяСтрока.ИмяКолонки = СтруктураКолонки.Имя;
		НоваяСтрока.Колонка = СтруктураКолонки.Заголовок;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	
	Для каждого Строка Из КолонкиСпецификации Цикл
	
		Строка.Включить = Истина;	
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого Строка Из КолонкиСпецификации Цикл
	
		Строка.Включить = Ложь;	
	
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	МассивКолонок = Новый Массив;
	
	Для каждого Строка Из КолонкиСпецификации Цикл
	
		Если Строка.Включить Тогда
		
			МассивКолонок.Добавить(Строка.ИмяКолонки);		
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Закрыть(МассивКолонок);
	
КонецПроцедуры
