
/////////////////////////////////////////////////
// 	ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПредметСнабжения") Тогда
	
		ТаблицаПрименямости.Параметры.УстановитьЗначениеПараметра("ПредметСнабжения", Параметры.ПредметСнабжения);
	
	КонецЕсли; 
		
	Если Параметры.Свойство("СоставляющаяЧасть") Тогда
	
		ТаблицаПрименямости.Параметры.УстановитьЗначениеПараметра("СоставляющаяЧасть", Параметры.СоставляющаяЧасть);
		
		ЭтаФорма.Заголовок = СтрШаблон(НСтр("ru = 'Удалить составляющую часть ""%1"" из спецификации предмета снабжения ""%2""?'"), Параметры.СоставляющаяЧасть, Параметры.ПредметСнабжения);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти
