Процедура ЗаполнитьИзКлассификатора() Экспорт
	
	// Удаление
	//Выборка = Справочники.ЕКПС.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СпрОб = Выборка.ПолучитьОбъект();
	//	СпрОб.Удалить();
	//КонецЦикла; 
	
	СпрЕКПС = Справочники.ЕКПС;
	ТаблДок = СпрЕКПС.ПолучитьМакет("Классификатор");
	
	Всего = ТаблДок.ВысотаТаблицы;
	ПредЭл = СпрЕКПС.ПустаяСсылка();
	СпрПустая = СпрЕКПС.ПустаяСсылка();
	
	Для сч = 1 По Всего Цикл
		
		НадоЗаписать = Ложь;
		
		НазваниеОбъекта = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		
		Если НазваниеОбъекта = "" Тогда
			Продолжить;
		КонецЕсли; 
		
		ЕстьГруппа = Найти(НазваниеОбъекта, "Группа") > 0;
		ЕстьКласс  = Найти(НазваниеОбъекта, "Класс" ) > 0;
		Если ЕстьГруппа ИЛИ ЕстьКласс Тогда
			
			Если ЕстьГруппа Тогда
				
				Позиция = Найти(НазваниеОбъекта, "Группа") + 7;
				КодГруппы = Сред(НазваниеОбъекта, Позиция, 2);
				Наим = Сред(НазваниеОбъекта, 11, СтрДлина(НазваниеОбъекта));
				Найд = СпрЕКПС.НайтиПоКоду(КодГруппы);
				Если Найд = СпрПустая Тогда
					СпрОб = СпрЕКПС.СоздатьГруппу();
					СпрОб.Код = КодГруппы;
					СпрОб.Наименование = Наим;
					НадоЗаписать = Истина;
				Иначе
					СпрОб = Найд.ПолучитьОбъект();
					Если НЕ СпрОб.Наименование = Наим Тогда
						СпрОб.Наименование = Наим;
						НадоЗаписать = Истина;
					КонецЕсли; 
				КонецЕсли; 
				
			Иначе
				
				Позиция = Найти(НазваниеОбъекта, "Класс") + 6;
				КодКласса = Сред(НазваниеОбъекта, Позиция, 4);
				Наим = Сред(НазваниеОбъекта, 12, СтрДлина(НазваниеОбъекта));
				Найд = СпрЕКПС.НайтиПоКоду(КодКласса);
				Если Найд = СпрПустая Тогда
					СпрОб = СпрЕКПС.СоздатьЭлемент();
					СпрОб.Код = КодКласса; 
					СпрОб.Родитель = СпрЕКПС.НайтиПоКоду(Лев(КодКласса, 2));
					СпрОб.Наименование = Наим;
					НадоЗаписать = Истина;
				Иначе
					СпрОб = Найд.ПолучитьОбъект();
					Если НЕ СпрОб.Наименование = Наим Тогда
						СпрОб.Наименование = Наим;
						НадоЗаписать = Истина;
					КонецЕсли;
					СпрРодитель = СпрЕКПС.НайтиПоКоду(Лев(КодКласса, 2));
					Если НЕ СпрОб.Родитель = СпрРодитель Тогда
						СпрОб.Родитель = СпрРодитель;
						НадоЗаписать = Истина;
					КонецЕсли;
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			СпрОб = ПредЭл.ПолучитьОбъект();
			
			Тмп = СпрОб.ОписаниеГруппировки + НазваниеОбъекта;
			Если НЕ СпрОб.ОписаниеГруппировки = Тмп Тогда
				СпрОб.ОписаниеГруппировки = Тмп;
				НадоЗаписать = Истина;
			КонецЕсли; 
			
		КонецЕсли;
		
		Если НадоЗаписать Тогда
			Попытка
				СпрОб.Записать();
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;			
		КонецЕсли; 
		
		ПредЭл = СпрОб.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры
