
&НаСервере
Процедура РезультатВыборСервер(Элемент, Область, СтандартнаяОбработка)
	
	аааа=1;
	
КонецПроцедуры
 

&НаКлиенте
Процедура РезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	
	аа=1;
	
КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(ИдентификаторРасшифровки)
	
	ДанныеРасшифровки1 = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	ЭлементРасшифровки = ДанныеРасшифровки1.Элементы[ИдентификаторРасшифровки];
	
	СсылкаЭлементСтруктуры = ЭлементРасшифровки.ПолучитьПоля()[0].Значение;
	
	Если ТипЗнч(СсылкаЭлементСтруктуры) = Тип("СправочникСсылка.СтруктураЗаказаПоКомплектующимИзделиямИЗИП") Тогда
		Возврат СсылкаЭлементСтруктуры;
	Иначе
		Возврат Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьВладельца(СсылкаЭлементСтруктуры)
	Возврат СсылкаЭлементСтруктуры.Владелец;
КонецФункции
 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаЭлементСтруктуры = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭлементСтруктуры", СсылкаЭлементСтруктуры);
	ДопПараметры.Вставить("Владелец", ВернутьВладельца(СсылкаЭлементСтруктуры));
	
	ОткрытьФорму("Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Форма.ФормаСписка", ДопПараметры);
	
КонецПроцедуры
