
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ 29.06.2018 Веденеев П. //отключение видимости служебного корабля в списке
	ОтборСлужебныйЗаказ = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСлужебныйЗаказ.Использование = Истина;
	ОтборСлужебныйЗаказ.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСлужебныйЗаказ.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборСлужебныйЗаказ.ПравоеЗначение = Константы.СлужебныйЗаказ.Получить();
	//++ 29.06.2018 Веденеев П. //отключение видимости служебного корабля в списке
		
КонецПроцедуры
