////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Элемент Из ЭтотОбъект Цикл
		// Автор
		Если Не ЗначениеЗаполнено(Элемент.Автор) Тогда
			Элемент.Автор = Пользователи.ТекущийПользователь();
		КонецЕсли; // Если Не ЗначениеЗаполнено(Элемент.Автор) Тогда
		// ДатаЗаписи
		Если Не ЗначениеЗаполнено(Элемент.ДатаЗаписи) Тогда
			Элемент.ДатаЗаписи = ТекущаяДата();
		КонецЕсли; // Если Не ЗначениеЗаполнено(Элемент.ДатаЗаписи) Тогда
	КонецЦикла; // Для Каждого Элемент Из ЭтотОбъект Цикл	
КонецПроцедуры // ПередЗаписью